Description: |
  Expands the zip archive downloaded with an Adobe Admin Console-
  generated downloader, identifies the package name, extracts
  package metadata from the installer using dataJAR's custom
  processor, then copies the installer package, renaming to
  match the recipe name and include the version.

  Intended use is to generate an override from this recipe, then
  give the override an unique Identifier and populate all the
  Input variables. When using the recipe, also provide the source
  archive via the -p parameter eg:
  autopkg run MyAdobeApp.pkg -p MyAdobeApp.zip

Identifier: com.github.davidbpirie.pkg.AdobeAdminConsole
MinimumVersion: 2.3.0
ParentRecipe: com.github.davidbpirie.pkginfo.AdobeAdminConsole

Input:
  NAME: AdobeAdminConsole

Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: '%aacp_install_pkg_path%'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
