Description: |
  For use with DataJAR's AdobeAdminConsolePackagesImporter.py.

  Using the information gathered by AdobeAdminConsolePackagesImporter.py,
  copies the identified pkg to the recipe cache dir.

  Intended use is to generate an override from this recipe, then
  give the override an unique Identifier and populate all the
  Input variables. As per AdobeAdminConsolePackagesImporter.py
  documentation, your override prefix has to match a name within the
  application names table (see https://github.com/autopkg/dataJAR-recipes/blob/master/Adobe%20Admin%20Console%20Packages/AdobeAutoPkgApplicationData.json).

  Your override should not be run directly, but rather will be
  updated and executed by AdobeAdminConsolePackagesImporter.py e.g.:
  sudo ./AdobeAdminConsolePackagesImporter.py pkg /path/to/downloaded-packages-dir

Identifier: com.github.davidbpirie.pkg.AdobeAdminConsole
MinimumVersion: 2.3.0

Input:
  NAME: AdobeAdminConsole
  aacp_package_path: Populate with AdobeAdminConsolePackagesImporter.py
  aacp_application_version: Populate with AdobeAdminConsolePackagesImporter.py

Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: '%aacp_package_path%'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%aacp_application_version%.pkg'
