<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of NAP Locked Down Browser as a DMG.</string>
		<key>Identifier</key>
		<string>com.github.davidbpirie.download.naplockeddownbrowser</string>
		<key>MinimumVersion</key>
		<string>2.0.0</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>NAPLockedDownBrowser</string>
			<key>DOWNLOAD_URL</key>
			<string>https://pages.assessform.edu.au/uploads/files/Release/NAP%20Locked%20down%20browser.dmg</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/NAP Locked down browser.app</string>
					<key>requirement</key>
					<string>anchor apple generic and identifier "au.com.janison.mac.naplan" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = KU9HRE5GET)</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>