Description: Downloads the latest version of NAP Locked Down Browser as a pkg, finds the version, then imports it to Munki.
Identifier: com.github.davidbpirie.munki.naplockeddownbrowser
ParentRecipe: com.github.davidbpirie.download.naplockeddownbrowser
MinimumVersion: 2.3.0

Input:
  NAME: NAPLockedDownBrowser
  MUNKI_DISPLAYNAME: NAP Locked Down Browser
  MUNKI_DESCRIPTION: Students will be required to use the NAPLAN test player locked down browser or App to perform the test.
  MUNKI_CATEGORY: Business
  MUNKI_DEVELOPER: ACARA
  MUNKI_MINIMUM_OS_VERSION: 10.15.4
  MUNKI_REPO_SUBDIR: '%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%'
  pkginfo:
    blocking_applications:
    - NAP Locked down browser.app
    catalogs:
    - testing
    category: '%MUNKI_CATEGORY%'
    description: '%MUNKI_DESCRIPTION%'
    developer: '%MUNKI_DEVELOPER%'
    display_name: '%MUNKI_DISPLAYNAME%'
    minimum_os_version: '%MUNKI_MINIMUM_OS_VERSION%'
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    flat_pkg_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'

- Processor: PkgPayloadUnpacker
  Arguments:
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/%NAME%.pkg/Payload'
    destination_path: '%RECIPE_CACHE_DIR%/payload'
    purge_destination: True

- Processor: PlistReader
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/payload/NAP Locked down browser.app'

- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      version: '%version%'

- Processor: MunkiInstallsItemsCreator
  Arguments:
    faux_root: '%RECIPE_CACHE_DIR%/payload'
    installs_item_paths:
      - /Applications/NAP Locked down browser.app

- Processor: MunkiPkginfoMerger

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
    - '%RECIPE_CACHE_DIR%/payload'
