<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of NAP Locked Down Browser as a DMG, then builds a package.</string>
	<key>Identifier</key>
	<string>com.github.davidbpirie.pkg.naplockeddownbrowser</string>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.davidbpirie.download.naplockeddownbrowser</string>
    <key>Input</key>
    <dict>
	    <key>NAME</key>
	    <string>NAPLockedDownBrowser</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>