Description: Downloads the latest version of NAP Locked Down Browser as a pkg.
Identifier: com.github.davidbpirie.download.naplockeddownbrowser
MinimumVersion: 2.3.0

Input:
  NAME: NAPLockedDownBrowser
  SEARCH_URL: https://www.assessform.edu.au/naplan-online/locked-down-browser
  SEARCH_RE: .*"([^"]*\.pkg)">Download for MacOS

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%SEARCH_RE%'
    url: '%SEARCH_URL%'
    result_output_var_name: match

- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.pkg'
    url: '%match%'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg'
    expected_authority_names:
      - "Developer ID Installer: Janison (KU9HRE5GET)"
      - "Developer ID Certification Authority"
      - "Apple Root CA"