<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of NAP Locked Down Browser as a DMG, then imports it to Munki.</string>
		<key>Identifier</key>
		<string>com.github.davidbpirie.munki.naplockeddownbrowser</string>
		<key>MinimumVersion</key>
		<string>2.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.davidbpirie.download.naplockeddownbrowser</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>NAPLockedDownBrowser</string>
			<key>MUNKI_DISPLAYNAME</key>
			<string>NAP Locked Down Browser</string>
			<key>MUNKI_DESCRIPTION</key>
			<string>Students will be required to use the NAPLAN test player locked down browser or App to perform the test.</string>
			<key>MUNKI_CATEGORY</key>
			<string>Business</string>
			<key>MUNKI_DEVELOPER</key>
			<string>ACARA</string>
			<key>MUNKI_MINIMUM_OS_VERSION</key>
			<string>10.15.4</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>Business/ACARA/NAP Locked Down Browser</string>
			<key>pkginfo</key>
			<dict>
				<key>name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>developer</key>
				<string>%MUNKI_DEVELOPER%</string>
				<key>blocking_applications</key>
				<array>
					<string>NAP Locked down browser.app</string>
				</array>
				<key>catalogs</key>
				<array>
					<string>dev</string>
				</array>
				<key>description</key>
				<string>%MUNKI_DESCRIPTION%</string>
				<key>display_name</key>
				<string>%MUNKI_DISPLAYNAME%</string>
				<key>minimum_os_version</key>
				<string>%MUNKI_MINIMUM_OS_VERSION%</string>
				<key>unattended_install</key>
				<true />
			</dict>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
					<key>pkg_path</key>
					<string>%pathname%</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>