Description: Downloads the latest version of NAP Locked Down Browser as a DMG, then builds a package.
Identifier: com.github.davidbpirie.pkg.naplockeddownbrowser
ParentRecipe: com.github.davidbpirie.download.naplockeddownbrowser
MinimumVersion: 2.3.0

Input:
  NAME: NAPLockedDownBrowser

Process:
- Processor: AppPkgCreator
