Description: Downloads the latest version of NAP Locked Down Browser as a DMG.
Identifier: com.github.davidbpirie.download.naplockeddownbrowser
MinimumVersion: 2.3.0

Input:
  NAME: NAPLockedDownBrowser
  DOWNLOAD_URL: https://pages.assessform.edu.au/uploads/files/Release/NAP%20Locked%20down%20browser.pkg

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.pkg'
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/downloads/%NAME%.pkg'
    expected_authority_names:
      - "Developer ID Installer: Janison (KU9HRE5GET)"
        "Developer ID Certification Authority"
        "Apple Root CA"