Description: Downloads the latest version of the DisplayLink Manager App package, then imports it to Munki.
Identifier: com.github.davidbpirie.munki.DisplayLink_Manager
ParentRecipe: com.github.smithjw.pkg.DisplayLink_Manager
MinimumVersion: 2.3.0

Input:
  NAME: DisplayLink Manager
  MUNKI_DISPLAYNAME: DisplayLink Manager
  MUNKI_DESCRIPTION: DisplayLink Manager is a new way to enable your DisplayLink dock, adapter or monitor on macOS platforms. It's an application that combines our latest driver with features that streamline the setup of mutliple displays up to 4K.
  MUNKI_CATEGORY: Utilities
  MUNKI_DEVELOPER: Synaptics
  MUNKI_MINIMUM_OS_VERSION: 11.0.0
  MUNKI_REPO_SUBDIR: '%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%'
  pkginfo:
    blocking_applications:
    - DisplayLink Manager.app
    catalogs:
    - testing
    category: '%MUNKI_CATEGORY%'
    description: '%MUNKI_DESCRIPTION%'
    developer: '%MUNKI_DEVELOPER%'
    display_name: '%MUNKI_DISPLAYNAME%'
    minimum_os_version: '%MUNKI_MINIMUM_OS_VERSION%'
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: MunkiImporter
  Arguments:
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
