Description: |
  Downloads the latest version of FabFilter Twin 2 as a dmg,
  then verifies the signature of the enclosed pkg.

Identifier: com.github.davidbpirie.download.FabFilterTwin2
MinimumVersion: 2.3.0

Input:
  NAME: FabFilterTwin2
  SEARCH_RE: href="([^"]*?\/fftwin2\w*?\.dmg)"
  SEARCH_URL: https://www.fabfilter.com/support/downloads

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%SEARCH_RE%'
      url: '%SEARCH_URL%'
      result_output_var_name: download_url

  - Processor: URLDownloader
    Arguments:
      url: '%download_url%'

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/*.pkg'
      expected_authority_names:
        - 'Developer ID Installer: FabFilter (43SG2JNHFW)'
        - Developer ID Certification Authority
        - Apple Root CA
