Description: |
  Downloads the latest version of FabFilter Pro-C 2 as a dmg,
  then verifies the signature of the enclosed pkg.

Identifier: com.github.davidbpirie.download.FabFilterProC2
MinimumVersion: 2.3.0

Input:
  NAME: FabFilterProC2
  BASE_URL: https://www.fabfilter.com
  SEARCH_RE: href="([^"]*?ffproc2[^"]*?\.dmg)"

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%SEARCH_RE%'
      url: '%BASE_URL%/download'
      result_output_var_name: download_url

  - Processor: URLDownloader
    Arguments:
      url: '%download_url%'

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/*.pkg'
      expected_authority_names:
        - 'Developer ID Installer: FabFilter (43SG2JNHFW)'
        - Developer ID Certification Authority
        - Apple Root CA
