<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of MultiMC, creates a dmg, then imports it to munki.</string>
        <key>Identifier</key>
        <string>com.github.davidbpirie.munki.MultiMC</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>MultiMC</string>
            <key>MUNKI_NAME</key>
            <string>MultiMC</string>
            <key>MUNKI_DISPLAYNAME</key>
            <string>MultiMC</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>MultiMC is an alternative launcher for Minecraft. It allows you to have multiple, cleanly separated instances of Minecraft (each with their own mods, resource packs, saves, etc) and helps you manage them and their associated options with a simple and powerful interface.</string>
            <key>MUNKI_CATEGORY</key>
            <string>Games</string>
            <key>MUNKI_DEVELOPER</key>
            <string>MultiMC</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>Games/MultiMC/MultiMC</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>blocking_applications</key>
                <array>
                    <string>MultiMC</string>
                </array>
                <key>unattended_install</key>
                <true/>
                <key>unattended_uninstall</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4</string>
        <key>ParentRecipe</key>
        <string>com.github.davidbpirie.download.MultiMC</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>name</key>
                        <string>%MUNKI_NAME%</string>
                        <key>display_name</key>
                        <string>%MUNKI_DISPLAYNAME%</string>
                        <key>description</key>
                        <string>%MUNKI_DESCRIPTION%</string>
                        <key>category</key>
                        <string>%MUNKI_CATEGORY%</string>
                        <key>developer</key>
                        <string>%MUNKI_DEVELOPER%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>DmgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_root</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%dmg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>