Description: |
  Downloads the latest version of noTunes from GitHub as a zip file,
  unarchives the app, and verifies the signature.
Identifier: com.github.davidbpirie.download.noTunes
MinimumVersion: 2.3.0

Input:
  NAME: noTunes
  GITHUB_REPO: tombonez/noTunes
  GITHUB_INCLUDE_PRELEASES: ''

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: '%GITHUB_REPO%'
      include_prereleases: '%GITHUB_INCLUDE_PRELEASES%'

  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%.zip'

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      purge_destination: True

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/unpack/*.app'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%found_filename%'
      requirement: anchor apple generic and identifier 'digital.twisted.noTunes' and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JP6WW46Y42)
