Description: |
  Downloads the latest version of North Pole Security Santa
  from GitHub as a pkg in a dmg, verifies the signature and
  finds the version.

Identifier: com.github.davidbpirie.pkg.NorthPoleSecSanta
ParentRecipe: com.github.autopkg.zentral.download.santa
MinimumVersion: 2.3.0

Input:
  NAME: NorthPoleSecSanta

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pathname%/*anta*pkg'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/app.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/var/db/santa/migration/Santa.app'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%/*anta*pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
