Description: |
  Downloads the latest version of North Pole Security Santa
  from GitHub as a pkg, verifies the signature and finds the
  version.

Identifier: com.github.davidbpirie.pkg.NorthPoleSecSanta
ParentRecipe: com.github.davidbpirie.download.NorthPoleSecSanta
MinimumVersion: 2.3.0

Input:
  NAME: NorthPoleSecSanta
  GITHUB_ASSET_REGEX: '.*\.pkg'

Process:
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%'
      expected_authority_names:
        - 'Developer ID Installer: North Pole Security, Inc. (ZMCG7MLDV9)'
        - 'Developer ID Certification Authority'
        - 'Apple Root CA'

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/app.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/var/db/santa/migration/Santa.app'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
