Description: |
  Downloads the latest version of North Pole Security Santa
  from GitHub.

Identifier: com.github.davidbpirie.download.NorthPoleSecSanta
MinimumVersion: 2.3.0

Input:
  NAME: NorthPoleSecSanta
  DOWNLOAD_SUFFIX: dmg
  GITHUB_REPO: northpolesec/santa
  GITHUB_INCLUDE_PRELEASES: ''
  GITHUB_ASSET_REGEX: '.*\.%DOWNLOAD_SUFFIX%'

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: Consider switching to the Santa recipes in the zentral-recipes repo. This recipe is deprecated and will be removed in the future.

  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: '%GITHUB_REPO%'
      include_prereleases: '%GITHUB_INCLUDE_PRELEASES%'
      asset_regex: '%GITHUB_ASSET_REGEX%'

  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%.%DOWNLOAD_SUFFIX%'

  - Processor: EndOfCheckPhase
