Description: |
  Downloads the latest version of PrompterPro as a zip archive, then
  extracts the dmg and verifies the code signature.
Identifier: com.github.davidbpirie.download.PrompterPro
MinimumVersion: 2.3.0

Input:
  NAME: PrompterPro
  url: https://cdn.purple.is/static/installers/prompterpro_installer.zip

Process:
  - Processor: URLDownloader

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unzip'
      purge_destination: True

  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: '%RECIPE_CACHE_DIR%/unzip'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/%app_name%'
      requirement: identifier "com.purple.babel" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = MQDAEZFX69
