Description: |
  Downloads the latest version of PrompterPro as a zip archive, extracts
  the dmg and verifies the code signature, then creates a pkg.
Identifier: com.github.davidbpirie.pkg.PrompterPro
ParentRecipe: com.github.davidbpirie.download.PrompterPro
MinimumVersion: 2.3.0

Input:
  NAME: PrompterPro

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: '%found_filename%/%app_name%'
      pkg_path: '%RECIPE_CACHE_DIR%/PrompterPro-%version%.pkg'
