Description: |
  Downloads the latest version of Jamf Connect 2 LaunchAgent and extracts
  its package, then uploads the package to Jamf Pro, creating the Category
  if required.

  JSS_URL, API_USERNAME, and API_PASSWORD, and for non-cloud instances
  SMB_URL, SMB_USERNAME and SMB_PASSWORD, are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.
Identifier: com.github.davidbpirie.jamf-upload.JamfConnect2LaunchAgent
MinimumVersion: "2.3"
ParentRecipe: com.github.dataJAR-recipes.pkg.Jamf Connect 2 LaunchAgent

Input:
  NAME: JamfConnectLaunchAgent
  JAMF_CATEGORY: Utilities
  JAMF_CATEGORY_PRIORITY: "10"
  JAMF_REPLACE_CATEGORY: "False"
  JAMF_PKG_NAME: "%NAME%"
  JAMF_PKG_INFO: "Jamf Connect is a collection of apps allowing for simple provisioning of local user accounts and password synchronization from a cloud identity provider (IdP) during an Apple provisioning workflow. This includes multi-factor authentication (MFA)."
  JAMF_PKG_NOTES: "Generated and uploaded by AutoPkg"
  JAMF_PKG_PRIORITY: "10"
  JAMF_REBOOT_REQUIRED: "False"
  JAMF_OS_REQUIREMENTS: ""
  JAMF_REQUIRED_PROCESSOR: None
  JAMF_SEND_NOTIFICATION: "False"
  JAMF_REPLACE_PKG: "False"
  JAMF_REPLACE_PKG_METADATA: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%JAMF_CATEGORY%"
      category_priority: "%JAMF_CATEGORY_PRIORITY%"
      replace_category: "%JAMF_REPLACE_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_name: "%JAMF_PKG_NAME%.pkg"
      pkg_category: "%JAMF_CATEGORY%"
      pkg_info: "%JAMF_PKG_INFO%"
      pkg_notes: "%JAMF_PKG_NOTES%"
      pkg_priority: "%JAMF_PKG_PRIORITY%"
      reboot_required: "%JAMF_REBOOT_REQUIRED%"
      os_requirements: "%JAMF_OS_REQUIREMENTS%"
      required_processor: "%JAMF_REQUIRED_PROCESSOR%"
      send_notification: "%JAMF_SEND_NOTIFICATION%"
      replace_pkg: "%JAMF_REPLACE_PKG%"
