<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of a Unity Support installer as specified in UNITY3D_COMPONENT_NAME.

            Create separate overrides for each required component.

            At time of writing supported UNITY3D_COMPONENT_NAME values are:
                Android
                AppleTV
                iOS
                Linux-IL2CPP
                Linux-Mono
                Linux-Server
                Mac-IL2CPP
                Mac-Server
                WebGL
                Windows-Mono
                Windows-Server
        </string>
        <key>Identifier</key>
        <string>com.github.davidbpirie.download.unity3dcomponent</string>
        <key>MinimumVersion</key>
        <string>2.0.0</string>
        <key>Input</key>
        <dict>
            <key>UNITY3D_COMPONENT_NAME</key>
            <string>Android</string>
            <key>NAME</key>
            <string>Unity 3D %UNITY3D_COMPONENT_NAME% Support</string>
            <key>UNITY3D_SEARCH_URL</key>
            <string>https://unity3d.com/unity-release/latest</string>
        </dict>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>re_pattern</key>
                    <string>(?P&lt;url&gt;https:\/\/[a-z0-9]+\.unity3d\.com\/.*\/UnitySetup-%UNITY3D_COMPONENT_NAME%-Support-for-Editor-(?P&lt;version&gt;[\d.f]+)\.pkg)</string>
                    <key>url</key>
                    <string>%UNITY3D_SEARCH_URL%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%url%</string>
                    <key>filename</key>
                    <string>%NAME%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>expected_authority_names</key>
                    <array>
                        <string>Developer ID Installer: Unity Technologies ApS (BVPN9UFA9B)</string>
                        <string>Developer ID Certification Authority</string>
                        <string>Apple Root CA</string>
                    </array>
                    <key>input_path</key>
                    <string>%pathname%</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
        </array>
    </dict>
</plist>