Description: |
  Downloads the latest version of Unity 6 as a pkg, verifies the code
  signature, then finds the version and copies the pkg to rename it.

  Set ARCH to one of:
  "" for Intel
  "Arm64" for ARM

Identifier: com.github.davidbpirie.pkg.Unity6
ParentRecipe: com.github.davidbpirie.download.Unity6
MinimumVersion: 2.3.0

Input:
  NAME: Unity6
  ARCH: Arm64

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    flat_pkg_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'

- Processor: PkgPayloadUnpacker
  Arguments:
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Unity.pkg.tmp/Payload'
    destination_path: '%RECIPE_CACHE_DIR%/payload'
    purge_destination: True

- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/payload/Unity/Unity.app'

- Processor: PkgCopier
  Arguments:
    source_pkg: '%pathname%'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%%ARCH%-%version%.pkg'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
    - '%RECIPE_CACHE_DIR%/payload'

