<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
        <string>Downloads the latest version of a Unity Support installer as specified in UNITY3D_COMPONENT_NAME, then imports it to Munki.

			Need to supply the munki item name for Unity 3D in UNITY_MUNKI_ITEM_NAME to correctly link this support installer to it along with the correct version.
			Use another recipe (eg com.github.joshua-d-miller.autopkg.munki.Unity3D) to import Unity itself.

			A preinstall script checks to make sure the same version of Unity 3D is installed, otherwise it fails.

			At time of writing supported UNITY3D_COMPONENT_NAME values are:
				Android
				AppleTV
				iOS
				Linux-IL2CPP
				Linux-Mono
				Linux-Server
				Mac-IL2CPP
				Mac-Server
				WebGL
				Windows-Mono
				Windows-Server
			
			View the source at UNITY3D_SEARCH_URL to check for changes to available Components.

			Create separate overrides for each required component, giving each a unique Identifier.

			Based on the work and methods in https://github.com/autopkg/apizz-recipes/tree/master/Unity but abstracted to a single recipe.
        </string>
		<key>Identifier</key>
        <string>com.github.davidbpirie.munki.unity3dcomponent</string>
		<key>MinimumVersion</key>
		<string>2.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.davidbpirie.download.unity3dcomponent</string>
		<key>Input</key>
		<dict>
            <key>UNITY3D_COMPONENT_NAME</key>
            <string>Android</string>
            <key>NAME</key>
            <string>Unity 3D %UNITY3D_COMPONENT_NAME% Support</string>
            <key>UNITY3D_SEARCH_URL</key>
            <string>https://unity3d.com/unity-release/latest</string>
			<key>UNITY3D_MUNKI_ITEM_NAME</key>
			<string>Unity 3D</string>
				<key>RECEIPT_PATH</key>
			<string>/Library/Receipts</string>

			<key>MUNKI_DISPLAYNAME</key>
			<string>Unity 3D %UNITY3D_COMPONENT_NAME% Support</string>
			<key>MUNKI_DESCRIPTION</key>
			<string>%UNITY3D_COMPONENT_NAME% support component for Unity 3D.</string>
			<key>MUNKI_CATEGORY</key>
			<string>Developer Tools</string>
			<key>MUNKI_DEVELOPER</key>
			<string>Unity Technologies</string>
			<key>MUNKI_MINIMUM_OS_VERSION</key>
			<string>10.13.0</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>Developer Tools/Unity Technologies/Unity 3D %UNITY3D_COMPONENT_NAME% Support</string>
			<key>pkginfo</key>
			<dict>
				<key>blocking_applications</key>
				<array>
					<string>Unity 3D.app</string>
				</array>
				<key>catalogs</key>
				<array>
					<string>dev</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>%MUNKI_DESCRIPTION%</string>
				<key>developer</key>
				<string>%MUNKI_DEVELOPER%</string>
				<key>display_name</key>
				<string>%MUNKI_DISPLAYNAME%</string>
				<key>minimum_os_version</key>
				<string>%MUNKI_MINIMUM_OS_VERSION%</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>installcheck_script</key>
						<string>#!/bin/bash
	# Check for existing receipt and version
	RECEIPT="%RECEIPT_PATH%/Unity3D_%UNITY3D_COMPONENT_NAME%_version.txt"
	INSTALLED_VERSION=$(cat "$RECEIPT")
	VERSION="%version%"

	if [ ! -f "$RECEIPT" ] || [ "$INSTALLED_VERSION" != "$VERSION" ] &amp;&amp; [[ "$INSTALLED_VERSION" &lt; "$VERSION" ]]; then
		exit 0
	else
		exit 1
	fi</string>
						<key>postinstall_script</key>
						<string>#!/bin/bash
	# Write version receipt to reference in installcheck_script as pkg receipt has no version
	RECEIPT="%RECEIPT_PATH%/Unity3D_%UNITY3D_COMPONENT_NAME%_version.txt"
	VERSION="%version%"

	echo "$VERSION" &gt; "$RECEIPT"</string>
						<key>postuninstall_script</key>
						<string>#!/bin/bash
	# Remove receipt
	RECEIPT="%RECEIPT_PATH%/Unity3D_%UNITY3D_COMPONENT_NAME%_version.txt"

	if [ -f "$RECEIPT" ]; then
		rm "$RECEIPT"
	fi</string>
						<key>update_for</key>
						<array>
							<string>%UNITY3D_MUNKI_ITEM_NAME%-%version%</string>
						</array>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>