Description: |
  Downloads the latest version of a Unity Support installer as specified
  in UNITY3D_COMPONENT_NAME, then imports it to Munki.
  Need to supply the munki item name for Unity 3D in UNITY_MUNKI_ITEM_NAME to correctly link this support installer to it along with the correct version.
  Use another recipe (eg com.github.joshua-d-miller.autopkg.munki.Unity3D) to import Unity itself.
  A preinstall script checks to make sure the same version of Unity 3D is installed, otherwise it fails.
  At time of writing supported UNITY3D_COMPONENT_NAME values are:
    Android
    AppleTV
    iOS
    Linux-IL2CPP
    Linux-Mono
    Linux-Server
    Mac-IL2CPP
    Mac-Server
    WebGL
    Windows-Mono
    Windows-Server
  
  View the source at UNITY3D_SEARCH_URL to check for changes to available Components.

  Create separate overrides for each required component, giving each a unique Identifier.

  Based on the work and methods in https://github.com/autopkg/apizz-recipes/tree/master/Unity but abstracted to a single recipe.
Identifier: com.github.davidbpirie.munki.unity3dcomponent
ParentRecipe: com.github.davidbpirie.download.unity3dcomponent
MinimumVersion: 2.3.0

Input:
  NAME: Unity 3D %UNITY3D_COMPONENT_NAME% Support
  UNITY3D_COMPONENT_NAME: Android
  UNITY3D_SEARCH_URL: https://unity3d.com/unity-release/latest
  UNITY3D_MUNKI_ITEM_NAME: Unity 3D
  RECEIPT_PATH: /Library/Receipts
  MUNKI_DISPLAYNAME: Unity 3D %UNITY3D_COMPONENT_NAME% Support
  MUNKI_DESCRIPTION: '%UNITY3D_COMPONENT_NAME% support component for Unity 3D.'
  MUNKI_CATEGORY: Developer Tools
  MUNKI_DEVELOPER: Unity Technologies
  MUNKI_MINIMUM_OS_VERSION: 10.13.0
  MUNKI_REPO_SUBDIR: '%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%'
  pkginfo:
    blocking_applications:
    - Unity 3D.app
    catalogs:
    - testing
    category: '%MUNKI_CATEGORY%'
    description: '%MUNKI_DESCRIPTION%'
    developer: '%MUNKI_DEVELOPER%'
    display_name: '%MUNKI_DISPLAYNAME%'
    minimum_os_version: '%MUNKI_MINIMUM_OS_VERSION%'
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      installcheck_script: |
        #!/bin/bash
            # Check for existing receipt and version
            RECEIPT="%RECEIPT_PATH%/Unity3D_%UNITY3D_COMPONENT_NAME%_version.txt"
            INSTALLED_VERSION=$(cat "$RECEIPT")
            VERSION="%version%"
        
            if [ ! -f "$RECEIPT" ] || [ "$INSTALLED_VERSION" != "$VERSION" ] && [[ "$INSTALLED_VERSION" < "$VERSION" ]]; then
                exit 0
            else
                exit 1
            fi"
      postinstall_script: |
        #!/bin/bash
            # Write version receipt to reference in installcheck_script as pkg receipt has no version
            RECEIPT="%RECEIPT_PATH%/Unity3D_%UNITY3D_COMPONENT_NAME%_version.txt"
            VERSION="%version%"
        
            echo "$VERSION" > "$RECEIPT""
      postuninstall_script: |
        #!/bin/bash
            # Remove receipt
            RECEIPT="%RECEIPT_PATH%/Unity3D_%UNITY3D_COMPONENT_NAME%_version.txt"
        
            if [ -f "$RECEIPT" ]; then
                rm "$RECEIPT"
            fi"
      update_for:
      - '%UNITY3D_MUNKI_ITEM_NAME%-%version%'
      version: '%version%'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
