Description: |
  Downloads the latest version of the Unitor Family Driver from the
  Apple Support site, verify the signature and extracts the version.
Identifier: com.github.davidbpirie.download.UnitorFamilyDriver
ParentRecipe: com.github.davidbpirie.download.AppleSupportArticle
MinimumVersion: 2.3.0

Input:
  NAME: UnitorFamilyDriver
  ARTICLE_ID: 106523

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pathname%/*.pkg'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/UnitorMIDIDriver.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/Library/Audio/MIDI Drivers/EmagicUSBMIDIDriver.plugin'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
