Description: |
  Downloads the Cisco Webex Audio Driver Package from the Cisco Webex
  Help Center page:
  https://help.webex.com/en-us/article/WBX9000031110/Cisco-Webex-Audio-Driver-Package-Download-for-Mac
  as a pkg, verifies the code signature, then finds the version.

Identifier: com.github.davidbpirie.pkg.WebexAudioDriver
ParentRecipe: com.github.davidbpirie.download.WebexAudioDriver
MinimumVersion: 2.3.0

Input:
  NAME: WebexAudioDriver

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/src_payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/src_payload/Library/Audio/Plug-Ins/HAL/CiscoAudioDevice.driver/Contents/Info.plist'
      plist_keys:
        CFBundleShortVersionString: version

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/src_payload'
