Description: |
  Downloads the latest version of the NDI Tools pkg and verifies
  the signature, then extracts the version of the NDI HX Driver
  and creates a package that installs the NDI Tools pkg
  via a postinstall script, applying the given choice to only
  install the NDI HX Driver. The postinstall script also writes
  the supplied version to:
  /Library/Application Support/NewTek/NDI/HX_Driver/version.txt

  PKG_ID is the ID of the generated package.

  When using the recipe, also provide the version via the -k parameter eg:
  autopkg run NDIHXDriver.pkg -k version=1.0

Identifier: com.github.davidbpirie.pkg.NDIHXDriver
ParentRecipe: com.github.davidbpirie.download.NDITools
MinimumVersion: 2.3.0

Input:
  NAME: NDIHXDriver
  version: Provide_version_in_input_key
  PKG_ID: com.github.davidbpirie.NDITools.NDIHXDriver

Process:
  - Processor: StopProcessingIf
    Arguments:
      predicate: version == 'Provide_version_in_input_key'

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        payload: '0775'
        scripts: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%/scripts/NDIToolsInstaller.pkg'

  - Processor: com.github.davidbpirie.SharedProcessors/FirstActivePackageInChoice
    Arguments:
      choices_pkg_path: '%pkg_path%'
      desired_choice: com.newtek.NDI-HX-Driver

  - Processor: com.github.grahampugh.recipes.commonprocessors/ChoicesXMLGenerator
    Arguments:
      choices_pkg_path: '%pkg_path%'
      desired_choices:
        - default
        - com.newtek.NDI-HX-Driver
      choices_xml_dest: '%RECIPE_CACHE_DIR%/%NAME%/scripts/choices.xml'
      recursive_child_items: 'True'

  - Processor: FileCreator
    Arguments:
      file_content: |
        #!/bin/zsh

        ################################################################################
        #
        # Installs the NDIToolsInstaller.pkg, applying the choices.xml choices file
        #
        ################################################################################

        ROOT_DIR="$( cd -- "$(/usr/bin/dirname "$0")"; pwd -P )"

        /usr/sbin/installer -applyChoiceChangesXML "${ROOT_DIR}/choices.xml" -pkg "${ROOT_DIR}/NDIToolsInstaller.pkg" -target /
        exitCode=$?
        if [ ${exitCode} -eq 0 ]; then
          echo "%version%" > "/Library/Application Support/NewTek/NDI/HX_Driver/version.txt"
        fi
        exit ${exitCode}
      file_mode: '0755'
      file_path: '%RECIPE_CACHE_DIR%/%NAME%/scripts/postinstall'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown: []
        id: '%PKG_ID%'
        options: purge_ds_store
        pkgname: '%NAME%-%version%'
        pkgroot: '%RECIPE_CACHE_DIR%/%NAME%/payload'
        scripts: '%RECIPE_CACHE_DIR%/%NAME%/scripts'
        version: '%version%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/%NAME%'
