Description: |
  Downloads the latest version of the NDI Tools pkg and verifies
  the signature, extracts the version of the given choice, creates
  a package that installs the NDI Tools pkg via a postinstall
  script applying the given choice, then uploads the package to
  Jamf Pro.

  PKG_ID is the ID of the generated package.

  desired_choice is the single pkg components you would like installed.
  To find all available choices, run:
  installer -showChoicesXML -pkg path/to/NDIToolsInstaller.pkg
  At time of writing these are:
    com.newtek.Application-Mac-NDI-ScanConverter
    com.newtek.Application-Mac-NDI-AccessManager
    com.newtek.Application-Mac-NDI-VirtualInput
    com.newtek.NDIVirtualCamera
    com.newtek.driver.NDIAudio
    com.newtek.Application-Mac-NDI-StudioMonitor
    com.newtek.ndi.recording
    com.newtek.Test-Patterns-Mac-
    com.newtek.NewTek-Import-SpeedHQ
    com.newtek.NDI-Transmit-AdobeCC
    com.newtek.DAL.NDIplugin
    com.newtek.DAL.NDIpluginlaunchdaemon
    com.newtek.HAL.NDIaudioplugin
    com.newtek.NDI.prefpane
    com.newtek.NDI-HX-Driver
    com.newtek.NDI-Tools

  JSS_URL, API_USERNAME, and API_PASSWORD, and for non-cloud instances
  SMB_URL, SMB_USERNAME and SMB_PASSWORD, are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.

  Intended use is to generate an override, specifying a single
  choice and providing an unique PKG_ID and Identifier, for
  each desired NDI Tools item.

Identifier: com.github.davidbpirie.jamf-upload.NDIToolsChoice
ParentRecipe: com.github.davidbpirie.pkg.NDIToolsChoice
MinimumVersion: 2.3.0

Input:
  NAME: NDIToolsChoice
  JAMF_CATEGORY: Photo & Video
  JAMF_PKG_NAME: '%NAME%'
  JAMF_PKG_INFO: NDI Tools.
  JAMF_PKG_NOTES: Uploaded by AutoPkg
  JAMF_PKG_OS_REQUIREMENTS: ''
  JAMF_PKG_PRIORITY: '10'
  JAMF_PKG_REBOOT_REQUIRED: 'False'
  JAMF_PKG_REPLACE: 'False'
  JAMF_PKG_REPLACE_METADATA: 'False'
  JAMF_PKG_REQUIRED_PROCESSOR: None
  JAMF_PKG_SEND_NOTIFICATION: 'False'
  JAMF_PKG_SUFFIX: 'pkg'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_name: '%JAMF_PKG_NAME%-%version%.%JAMF_PKG_SUFFIX%'
      pkg_path: '%pkg_path%'
      pkg_category: '%JAMF_CATEGORY%'
      pkg_info: '%JAMF_PKG_INFO%'
      pkg_notes: '%JAMF_PKG_NOTES%'
      pkg_priority: '%JAMF_PKG_PRIORITY%'
      reboot_required: '%JAMF_PKG_REBOOT_REQUIRED%'
      os_requirements: '%JAMF_PKG_OS_REQUIREMENTS%'
      required_processor: '%JAMF_PKG_REQUIRED_PROCESSOR%'
      send_notification: '%JAMF_PKG_SEND_NOTIFICATION%'
      replace_pkg: '%JAMF_PKG_REPLACE%'
      replace_pkg_metadata: '%JAMF_PKG_REPLACE_METADATA%'
