<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Microsoft Azude Data Studio, creates a dmg, then imports it to munki.</string>
        <key>Identifier</key>
        <string>com.github.davidbpirie.munki.AzureDataStudio</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>AzureDataStudio</string>
            <key>MUNKI_NAME</key>
            <string>AzureDataStudio</string>
            <key>MUNKI_DISPLAYNAME</key>
            <string>Azure Data Studio</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>Azure Data Studio is a cross-platform database tool for data professionals using on-premises and cloud data platforms on Windows, macOS, and Linux.</string>
            <key>MUNKI_CATEGORY</key>
            <string>Developer Tools</string>
            <key>MUNKI_DEVELOPER</key>
            <string>Microsoft</string>
            <key>MUNKI_MINIMUM_OS_VERSION</key>
            <string>10.12.0</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>blocking_applications</key>
                <array>
                    <string>Azure Data Studio</string>
                </array>
                <key>unattended_install</key>
                <true />
                <key>unattended_uninstall</key>
                <true />
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4</string>
        <key>ParentRecipe</key>
        <string>com.github.davidbpirie.download.AzureDataStudio</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>name</key>
                        <string>%MUNKI_NAME%</string>
                        <key>display_name</key>
                        <string>%MUNKI_DISPLAYNAME%</string>
                        <key>description</key>
                        <string>%MUNKI_DESCRIPTION%</string>
                        <key>category</key>
                        <string>%MUNKI_CATEGORY%</string>
                        <key>developer</key>
                        <string>%MUNKI_DEVELOPER%</string>
                        <key>minimum_os_version</key>
                        <string>%MUNKI_MINIMUM_OS_VERSION%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>DmgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>dmg_root</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>dmg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%dmg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>