Description: Download recipe for Microsoft Azure Data Studio.
Identifier: com.github.davidbpirie.download.AzureDataStudio
MinimumVersion: 2.3.0

Input:
  NAME: AzureDataStudio
  PRODUCTID: '2204569'
  DOWNLOADURL: 'https://go.microsoft.com/fwlink/?linkid=%PRODUCTID%'

Process:
- Processor: URLDownloader
  Arguments:
    url: '%DOWNLOADURL%'
    filename: azuredatastudio-macos.zip

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%/Azure Data Studio.app'
    requirement: identifier "com.azuredatastudio.oss" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9
    strict_verification: true
