<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for Microsoft Azure Data Studio.</string>
        <key>Identifier</key>
        <string>com.github.davidbpirie.download.AzureDataStudio</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>AzureDataStudio</string>
            <key>BASE_URL</key>
            <string>https://docs.microsoft.com/en-gb/sql/azure-data-studio/download-azure-data-studio</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%BASE_URL%</string>
                    <key>result_output_var_name</key>
                    <string>url</string>
                    <key>re_pattern</key>
                    <string>Download\s*&lt;a href=\&quot;([^\&quot;]*)\&quot;.*&gt;\s*?Azure Data Studio for macOS&lt;</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%url%</string>
                    <key>filename</key>
                    <string>azuredatastudio-macos.zip</string>
                    <key>curl_opts</key>
                    <array>
                        <string>--no-alpn</string>
                    </array>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>archive_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
            </dict>
            <dict>
               <key>Processor</key>
               <string>CodeSignatureVerifier</string>
               <key>Arguments</key>
               <dict>
                  <key>input_path</key>
                  <string>%RECIPE_CACHE_DIR%/%NAME%/Azure Data Studio.app</string>
                  <key>requirement</key>
                  <string>identifier "com.azuredatastudio.oss" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9</string>
                  <key>strict_verification</key>
                  <true />
                 </dict>
            </dict>
        </array>
    </dict>
    </plist>