Description: Downloads the latest version of Microsoft Azude Data Studio, creates a dmg, then imports it to munki.
Identifier: com.github.davidbpirie.munki.AzureDataStudio
ParentRecipe: com.github.dataJAR-recipes.download.AzureDataStudio
MinimumVersion: 2.3.0

Input:
  NAME: AzureDataStudio
  MUNKI_DISPLAYNAME: Azure Data Studio
  MUNKI_DESCRIPTION: Azure Data Studio is a cross-platform database tool for data professionals using on-premises and cloud data platforms on Windows, macOS, and Linux.
  MUNKI_CATEGORY: Developer Tools
  MUNKI_DEVELOPER: Microsoft
  MUNKI_MINIMUM_OS_VERSION: 10.12.0
  MUNKI_REPO_SUBDIR: '%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%'
  pkginfo:
    blocking_applications:
    - Azure Data Studio
    catalogs:
    - testing
    category: '%MUNKI_CATEGORY%'
    description: '%MUNKI_DESCRIPTION%'
    developer: '%MUNKI_DEVELOPER%'
    display_name: '%MUNKI_DISPLAYNAME%'
    minimum_os_version: '%MUNKI_MINIMUM_OS_VERSION%'
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true

Process:
- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:

- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%dmg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
