Description: |
  Downloads the latest version of EyeJack Creator, then builds a package.
Identifier: com.github.davidbpirie.pkg.EyeJackCreator
ParentRecipe: com.github.davidbpirie.download.EyeJackCreator
MinimumVersion: 2.3.0

Input:
  NAME: EyeJackCreator

Process:
- Processor: AppPkgCreator
