Description: |
  Downloads the latest version of Yamaha R Remote as a zipped dmg,
  expands, verifies the signature of the enclosed pkg, extracts
  the version and copies the pkg.

Identifier: com.github.davidbpirie.pkg.YamahaRRemote
MinimumVersion: 2.3.0
ParentRecipe: com.github.davidbpirie.download.YamahaRRemote

Input:
  NAME: YamahaRRemote

Process:
  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unzip'
      purge_destination: True

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unzip/*/*.pkg'
      expected_authority_names:
        - 'Developer ID Installer: Yamaha Corporation (5LE7A8CF65)'
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%RECIPE_CACHE_DIR%/unzip/*/*.pkg'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/RRemote.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/Applications/R Remote.app/Contents/Info.plist'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%RECIPE_CACHE_DIR%/unzip/*/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unzip'
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
