Description: |
  Downloads the latest verison of Logitech Options Plus offline installer application.
  See:
  https://prosupport.logi.com/hc/en-us/articles/10991109278871-Logitech-Options-Offline-Installer
  for details.
  As the installer version is of a different format to the installed application (e.g. 1.76.0.583666 instead of 1.76.583666)
  the processor uses the first, second, and last segments of the installer version as the app version, stripping
  out any other segments.
Identifier: com.github.davidbpirie.download.logitechoptionsplus
MinimumVersion: 2.3.0

Input:
  NAME: LogitechOptionsPlus
  DOWNLOAD_URL: https://download01.logi.com/web/ftp/pub/techsupport/optionsplus/logioptionsplus_installer_offline.zip
  INSTALLER_APP_NAME: logioptionsplus_installer_offline

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.zip'
    url: '%DOWNLOAD_URL%'

- Processor: Unarchiver
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/expand'
    purge_destination: true

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/expand/%INSTALLER_APP_NAME%.app'
    requirement: 'identifier "com.logi.optionsplus.installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = QED4VVPZWA'

- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/expand/%INSTALLER_APP_NAME%.app/Contents/Info.plist'
    plist_version_key: CFBundleVersion
