Description: |
  Downloads the latest verison of Logitech Options Plus offline installer application,
  then creates a pkg that runs the installer app with the silent option.
  See:
  https://prosupport.logi.com/hc/en-gb/articles/6046882446359-Mass-installation-and-configuration-of-Logitech-Options-software#h.k97ihcogiap9
  for details.
Identifier: com.github.davidbpirie.pkg.logitechoptionsplus
ParentRecipe: com.github.davidbpirie.download.logitechoptionsplus
MinimumVersion: 2.3.0

Input:
  NAME: LogitechOptionsPlus
  INSTALLER_APP_NAME: 'logioptionsplus_installer'
  INSTALLER_LOG: '/private/tmp'
  INSTALLER_FLAG_ANALYTICS: 'No'
  INSTALLER_FLAG_FLOW: 'No'
  INSTALLER_FLAG_SSO: 'No'
  INSTALLER_FLAG_UPDATE: 'Yes'
  INSTALLER_FLAG_BACKLIGHT: 'Yes'
  INSTALLER_FLAG_ADDITIONS: ''
  PKG_ID: com.github.davidbpirie.logitechoptionsplus

Process:
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      payload: '0775'
      scripts: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: Copier
  Arguments:
    source_path: '%RECIPE_CACHE_DIR%/expand/%INSTALLER_APP_NAME%.app'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%/scripts/%INSTALLER_APP_NAME%.app'

- Processor: FileCreator
  Arguments:
    file_content: |
      #!/bin/zsh

      ################################################################################
      #
      # Runs the Logitech Options Plus installer silently
      #
      ################################################################################

      ROOT_DIR="$( cd -- "$(/usr/bin/dirname "$0")"; pwd -P )"

      "${ROOT_DIR}/%INSTALLER_APP_NAME%.app/Contents/MacOS/logioptionsplus_installer" --quiet --log %INSTALLER_LOG% --analytics %INSTALLER_FLAG_ANALYTICS% --flow %INSTALLER_FLAG_FLOW% --sso %INSTALLER_FLAG_SSO% --update %INSTALLER_FLAG_UPDATE% --backlight %INSTALLER_FLAG_BACKLIGHT% %INSTALLER_FLAG_ADDITIONS%

      exit $?
    file_mode: '0755'
    file_path: '%RECIPE_CACHE_DIR%/%NAME%/scripts/postinstall'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown: []
      id: '%PKG_ID%'
      options: purge_ds_store
      pkgname: '%NAME%-%version%'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%/payload'
      scripts: '%RECIPE_CACHE_DIR%/%NAME%/scripts'
      version: '%version%'

- Processor: PathDeleter
  Arguments:
    path_list:
      - '%RECIPE_CACHE_DIR%/expand'
      - '%RECIPE_CACHE_DIR%/%NAME%'