Description: |
  Downloads the latest version of PaperCut MF as a dmg, verifies
  the signature of the enclosed Standard Install pkg, extracts
  the version, then copies the pkg.

Identifier: com.github.davidbpirie.pkg.PaperCutMFStandardInstall
ParentRecipe: com.github.davidbpirie.download.PaperCutMF
MinimumVersion: 2.3.0

Input:
  NAME: PaperCutMFStandardInstall
  SRC_PKG_NAME: PaperCut MF Standard Install.pkg

Process:
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/%SRC_PKG_NAME%'
      expected_authority_names:
        - 'Developer ID Installer: PaperCut Software International Pty Ltd (B5N3YV5P2H)'
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pathname%/%SRC_PKG_NAME%'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      purge_destination: True

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/unpack/*.pkg'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%found_filename%/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: version-major=(.*)
      url: file://%RECIPE_CACHE_DIR%/payload/PaperCut%20MF/release/version.txt
      result_output_var_name: version_major

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: version-minor=(.*)
      url: file://%RECIPE_CACHE_DIR%/payload/PaperCut%20MF/release/version.txt
      result_output_var_name: version_minor

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: version-patch=(.*)
      url: file://%RECIPE_CACHE_DIR%/payload/PaperCut%20MF/release/version.txt
      result_output_var_name: version_patch

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: version-suffix=(.*)
      url: file://%RECIPE_CACHE_DIR%/payload/PaperCut%20MF/release/version.txt
      result_output_var_name: version_suffix

  - Processor: PkgCopier
    Arguments:
      version: '%version_major%.%version_minor%.%version_patch%%version_suffix%'
      source_pkg: '%pathname%/%SRC_PKG_NAME%'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version_major%.%version_minor%.%version_patch%%version_suffix%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'