Description: |
  Downloads the latest version of PaperCut MF as a dmg.

Identifier: com.github.davidbpirie.download.PaperCutMF
MinimumVersion: 2.3.0

Input:
  NAME: PaperCutMF
  BASE_URL: https://www.papercut.com/api/product/mf/latest/mac/

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: Consider switching to the PaperCutPrintDeployClient recipes in the dataJAR-recipes repo. This recipe is deprecated and will be removed in the future.

  - Processor: URLDownloader
    Arguments:
      url: '%BASE_URL%'
      filename: '%NAME%.dmg'

  - Processor: EndOfCheckPhase
