Description: Downloads latest DYMO Connect package.
Identifier: com.github.davidbpirie.download.DYMOConnect
MinimumVersion: 2.3.0

Input:
  NAME: DYMOConnect
  BASE_URL: https://www.dymo.com/support?cfid=user-guide
  RE_PATTERN: href=\"([^\"]*DCDMac[0-9\.]*\.pkg)\">Download
  USER_AGENT: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/114.0.0.0 Safari/537.36 Edg/114.0.1823.82

Process:
- Processor: DeprecationWarning
  Arguments:
    warning_message: This recipe no longer functions as DYMO has modified how their site operates. PRs for alternative solutions welcome.

- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%RE_PATTERN%'
    request_headers:
      user-agent: '%USER_AGENT%'
    result_output_var_name: url
    url: '%BASE_URL%'

- Processor: URLDownloader

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%'
    expected_authority_names:
      - 'Developer ID Installer: Sanford, L.P. (N3S6676K3E)'
      - 'Developer ID Certification Authority'
      - 'Apple Root CA'
