Description: Downloads latest DYMO Connect package.
Identifier: com.github.davidbpirie.download.DYMOConnect
MinimumVersion: 2.3.0

Input:
  NAME: DYMOConnect
  BASE_URL: https://www.dymo.com/support?cfid=user-guide
  request_headers:
    user-agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/114.0.0.0 Safari/537.36 Edg/114.0.1823.82
    accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8
    accept-language: en-US,en;q=0.9
    connection: keep-alive
    upgrade-insecure-requests: 1
    sec-fetch-site: none
    sec-fetch-mode: navigate
    sec-fetch-user: '?1'
    sec-fetch-dest: document
  RE_PATTERN: href=\"([^\"]*DCDMac[0-9\.]*\.pkg)\">\s*Download

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: '%RE_PATTERN%'
    result_output_var_name: url
    url: '%BASE_URL%'

- Processor: URLDownloader

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%'
    expected_authority_names:
      - 'Developer ID Installer: Sanford, L.P. (N3S6676K3E)'
      - 'Developer ID Certification Authority'
      - 'Apple Root CA'
