<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for Alice 2 from alice.org. Obtains the English Complete installer.</string>
        <key>Identifier</key>
        <string>com.github.davidbpirie.download.Alice2</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Alice2</string>
            <key>BASE_URL</key>
            <string>http://www.alice.org/get-alice/alice-2/</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>re_pattern</key>
                    <string>&lt;a href=&quot;([^&quot;]*e\.dmg)&quot;</string>
                    <key>url</key>
                    <string>%BASE_URL%</string>
                    <key>result_output_var_name</key>
                    <string>url</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>