<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Alice 2, then imports to munki.</string>
        <key>Identifier</key>
        <string>com.github.davidbpirie.munki.Alice2</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Alice2</string>
            <key>MUNKI_NAME</key>
            <string>Alice2</string>
            <key>MUNKI_DISPLAYNAME</key>
            <string>Alice 2</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>Alice is an innovative block-based programming environment that makes it easy to create animations, build interactive narratives, or program simple games in 3D.</string>
            <key>MUNKI_CATEGORY</key>
            <string>Developer Tools</string>
            <key>MUNKI_DEVELOPER</key>
            <string>alice.org</string>
            <key>MUNKI_MINIMUM_OS_VERSION</key>
            <string>10.6.0</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>Developer Tools/alice.org/Alice2</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>unattended_install</key>
                <true/>
                <key>unattended_uninstall</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4</string>
        <key>ParentRecipe</key>
        <string>com.github.davidbpirie.download.Alice2</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>name</key>
                        <string>%MUNKI_NAME%</string>
                        <key>display_name</key>
                        <string>%MUNKI_DISPLAYNAME%</string>
                        <key>description</key>
                        <string>%MUNKI_DESCRIPTION%</string>
                        <key>category</key>
                        <string>%MUNKI_CATEGORY%</string>
                        <key>developer</key>
                        <string>%MUNKI_DEVELOPER%</string>
                        <key>minimum_os_version</key>
                        <string>%MUNKI_MINIMUM_OS_VERSION%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>