Description: |
  Downloads VueScan, verifies the app signature, creates an installer
  package with the app and the needed authorization file, then uploads
  the package to Jamf Pro and deletes the local copy.

  The recipe requires the authorization file created by VueScan for your
  licence. The suggested way to do this is to install VueScan on the
  Mac/VM running AutoPkg and use the recipe's default value for RC_FILE.
  Alternately, you can create a text file made up of the following four
  lines (where you replace # with the values for your license):

  [VueScan]
  SerialNumber=#
  CustomerNumber=#
  EmailAddress=#@#.#

  Then, save that file in a locally-accessible location and set the
  RC_FILE input variable to the path to that file (including the file
  name with extension). AutoPkg will do the rest.

  JSS_URL, API_USERNAME, and API_PASSWORD, and for non-cloud instances
  SMB_URL, SMB_USERNAME and SMB_PASSWORD, are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.

Identifier: com.github.davidbpirie.jamf-upload.VueScanLicenced
MinimumVersion: 2.3.0
ParentRecipe: com.github.jazzace.pkg.VueScanLicenced

Input:
  NAME: VueScanLicenced
  RC_FILE: /Users/Shared/.vuescanrc
  JAMF_CATEGORY: Photo and Video
  JAMF_PKG_NAME: '%NAME%'
  JAMF_PKG_INFO: VueScan is for image scanning, especially photographs, including negatives. It supports optical character recognition (OCR) of text documents.
  JAMF_PKG_NOTES: 'Generated and uploaded by AutoPkg'
  JAMF_PKG_PRIORITY: '10'
  JAMF_PKG_REBOOT_REQUIRED: 'False'
  JAMF_PKG_OS_REQUIREMENTS: ''
  JAMF_PKG_REQUIRED_PROCESSOR: None
  JAMF_PKG_SEND_NOTIFICATION: 'False'
  JAMF_PKG_REPLACE: 'False'
  JAMF_PKG_REPLACE_METADATA: 'False'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_name: '%JAMF_PKG_NAME%-%version%.pkg'
      pkg_category: '%JAMF_CATEGORY%'
      pkg_info: '%JAMF_PKG_INFO%'
      pkg_notes: '%JAMF_PKG_NOTES%'
      pkg_priority: '%JAMF_PKG_PRIORITY%'
      reboot_required: '%JAMF_PKG_REBOOT_REQUIRED%'
      os_requirements: '%JAMF_PKG_OS_REQUIREMENTS%'
      required_processor: '%JAMF_PKG_REQUIRED_PROCESSOR%'
      send_notification: '%JAMF_PKG_SEND_NOTIFICATION%'
      replace_pkg: '%JAMF_PKG_REPLACE%'
      replace_pkg_metadata: '%JAMF_PKG_REPLACE_METADATA%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%pkg_path%'
