Description: |
  Copies the content installer pkg from the source DMG, verifies
  the signature and extracts the version.

  All Native Access content delivered on DMGs include a <content> Factory
  Content.pkg component, so version information is read from there.

  Package source DMG must be manually downloaded using Native Access,
  grabbing the DMG from the Downloads folder before it is deleted, then
  provided either as Input Variable PKG or via the -p parameter eg:
  autopkg run NativeAccessDMGContent.pkg -p "path/to/Content_Installer.dmg"

Identifier: com.github.davidbpirie.pkg.NativeAccessDMGContent
MinimumVersion: 2.3.0

Input:
  NAME: NativeAccessDMGContent

Process:
  - Processor: PackageRequired

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%PKG%/*.pkg'
      expected_authority_names:
        - 'Developer ID Installer: Native Instruments GmbH (83K5EG6Z9V)'
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%PKG%/*.pkg'
      skip_payload: False
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      purge_destination: True

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/unpack/* Factory Content.pkg'

  - Processor: com.github.nmcspadden.shared/PackageInfoVersioner
    Arguments:
      package_info_path: '%found_filename%/PackageInfo'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%PKG%/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
