Description: |
  Locates the main installation pkg from the source ISO, verifies
  the signature, extracts the version, then creates a new
  payload-free pkg with the source pkg in the scripts directory
  and a postinstall script to install it with only the provided
  choice selected.

  All Native Access content delivered on ISOs include a <content>
  Factory Content.pkg component, so version information is read
  from there.
  They also include the main content in separate Part X.pkg files,
  which are stripped out in this process. It is intended that this
  content is made available through a network share.

  Package source ISO must be manually downloaded using Native Access,
  grabbing the ISO from the Downloads folder before it is deleted, then
  provided either as Input Variable PKG or via the -p parameter eg:
  autopkg run NativeAccessISOContentMinimal.pkg -p "path/to/Content_Installer.iso"

  desired_choices is the list of pkg components you would like installed,
  which must be set in your override. To find all available choices, run:
  installer -showChoicesXML -pkg "path/to/Content Installer Mac.pkg"

Identifier: com.github.davidbpirie.pkg.NativeAccessISOContentMinimal
MinimumVersion: 2.3.0

Input:
  NAME: NativeAccessISOContentMinimal
  desired_choices:
    - NativeAccessISOContentLibrary

Process:
  - Processor: PackageRequired

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%PKG%/* Installer Mac.pkg'
      expected_authority_names:
        - 'Developer ID Installer: Native Instruments GmbH (83K5EG6Z9V)'
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%PKG%/* Installer Mac.pkg'
      skip_payload: False
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      purge_destination: True

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/unpack/* Factory Content.pkg'

  - Processor: com.github.nmcspadden.shared/PackageInfoVersioner
    Arguments:
      package_info_path: '%found_filename%/PackageInfo'

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        payload: '0775'
        scripts: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%PKG%/* Installer Mac.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%/scripts/%NAME%.pkg'

  - Processor: com.github.grahampugh.recipes.commonprocessors/ChoicesXMLGenerator
    Arguments:
      choices_pkg_path: '%pkg_path%'
      choices_xml_dest: '%RECIPE_CACHE_DIR%/%NAME%/scripts/choices.xml'

  - Processor: FileCreator
    Arguments:
      file_content: |
        #!/bin/zsh

        ################################################################################
        #
        # Installs the Native Instruments ISO content package, applying the choices.xml
        # choices file.
        #
        ################################################################################

        ROOT_DIR="$( cd -- "$(/usr/bin/dirname "$0")"; pwd -P )"

        /usr/sbin/installer -applyChoiceChangesXML "${ROOT_DIR}/choices.xml" -pkg "${ROOT_DIR}/%NAME%.pkg" -target / -allowUntrusted
        exit $?
      file_mode: '0755'
      file_path: '%RECIPE_CACHE_DIR%/%NAME%/scripts/postinstall'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown: []
        id: '%PKG_ID%'
        options: purge_ds_store
        pkgname: '%NAME%-%version%'
        pkgroot: '%RECIPE_CACHE_DIR%/%NAME%/payload'
        scripts: '%RECIPE_CACHE_DIR%/%NAME%/scripts'
        version: '%version%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/%NAME%'
