<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest TeamViewer Host installer and extracts the installer pkg from the installer app.</string>
		<key>Identifier</key>
		<string>com.github.davidbpirie.pkg.TeamViewerHost</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>TeamViewerHost</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.4</string>
        <key>ParentRecipe</key>
		<string>com.github.davidbpirie.download.TeamViewerHost</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>PkgCopier</string>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%pathname%/Install TeamViewerHost.app/Contents/Resources/Install TeamViewerHost.pkg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
