<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Munki import recipe for TeamViewer Host.
                Follows instructions from https://community.teamviewer.com/English/kb/articles/50739-mass-deployment-on-macos
                on making a silent installer, and assumes the public download is comparable with the installer in the documentation.</string>
        <key>Identifier</key>
        <string>com.github.davidbpirie.munki.TeamViewerHost</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>TeamViewerHost</string>
            <key>MUNKI_NAME</key>
            <string>TeamViewerHost</string>
            <key>MUNKI_DISPLAYNAME</key>
            <string>TeamViewer Host</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>All-In-One Solution for Remote Access and Support over the Internet.</string>
            <key>MUNKI_CATEGORY</key>
            <string>Utilities</string>
            <key>MUNKI_DEVELOPER</key>
            <string>TeamViewer GmbH</string>
            <key>MUNKI_MINIMUM_OS_VERSION</key>
            <string>10.13</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>Utilities/TeamViewer GmbH/TeamViewerHost</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>unattended_install</key>
                <true/>
                <key>unattended_uninstall</key>
                <true/>
                <key>installer_choices_xml</key>
                <array>
                    <dict>
                        <key>attributeSetting</key>
                        <integer>1</integer>
                        <key>choiceAttribute</key>
                        <string>selected</string>
                        <key>choiceIdentifier</key>
                        <string>com.teamviewer.teamviewerhostSilentInstaller</string>
                    </dict>
                </array>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4</string>
        <key>ParentRecipe</key>
        <string>com.github.davidbpirie.pkg.TeamViewerHost</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>name</key>
                        <string>%MUNKI_NAME%</string>
                        <key>display_name</key>
                        <string>%MUNKI_DISPLAYNAME%</string>
                        <key>description</key>
                        <string>%MUNKI_DESCRIPTION%</string>
                        <key>category</key>
                        <string>%MUNKI_CATEGORY%</string>
                        <key>developer</key>
                        <string>%MUNKI_DEVELOPER%</string>
                        <key>minimum_os_version</key>
                        <string>%MUNKI_MINIMUM_OS_VERSION%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pkg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
