Description: Downloads the latest version of Comic Life 3 as a zip and extracts it.
Identifier: com.github.davidbpirie.download.comiclife3
MinimumVersion: 2.3.0

Input:
  NAME: ComicLife3
  DOWNLOAD_URL: https://downloads.plasq.com/comiclife3.zip

Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.zip'
    url: '%DOWNLOAD_URL%'

- Processor: EndOfCheckPhase

- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%_Source'
    purge_destination: YES

- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%_Source/Comic Life 3.app'
    requirement: anchor apple generic and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = RM33QGZJ9T)
