Description: |
  Downloads the latest version of Sidus TC Sync as a pkg,
  verifies the signature, extracts the version and copies
  the pkg.

Identifier: com.github.davidbpirie.pkg.SidusTCSync
MinimumVersion: 2.3.0
ParentRecipe: com.github.davidbpirie.download.SidusTCSync

Input:
  NAME: SidusTCSync

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/sync.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/Applications/Sidus TC Sync.app/Contents/Info.plist'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
