Description: |
  Downloads the latest pkg installer of Valhalla Supermassive, verifies
  the signature, extracts the version, and copies the pkg.

Identifier: com.github.davidbpirie.pkg.ValhallaSupermassive
ParentRecipe: com.github.dataJAR-recipes.download.Valhalla Supermassive
MinimumVersion: 2.3.0

Input:
  NAME: ValhallaSupermassive

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pkg_path%'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/AAX.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/Library/Application Support/Avid/Audio/Plug-Ins/ValhallaSupermassive.aaxplugin/Contents/Info.plist'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pkg_path%'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%source_pkg%'
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
