Description: |
  Downloads the latest Ricoh printer driver for a specific model,
  verifies the signature and finds the version.

  Set the Input values for MODEL in your override to match your
  required download.

Identifier: com.github.davidbpirie.pkg.RicohPrinterDriver
ParentRecipe: com.github.davidbpirie.download.RicohPrinterDriver
MinimumVersion: 2.3.0

Input:
  NAME: RicohPrinterDriver
  PAYLOAD_VERSION_PKG: ppds.pkg

Process:
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/*.pkg'
      expected_authority_names:
        - 'Developer ID Installer: Ricoh Co., Ltd. (5KACUT3YX8)'
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pathname%/*.pkg'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: \s*<product id=".*" version="(.*)"/>
      result_output_var_name: version
      url: file:///%RECIPE_CACHE_DIR%/unpack/Distribution

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: \s*<pkg-ref id=com\.RICOH\.print\.PS_Printers_Vol([0-9]*)_EXP\.ppds\.pkg
      result_output_var_name: version_major
      url: file:///%RECIPE_CACHE_DIR%/unpack/Distribution

  - Processor: com.github.nmcspadden.shared/PackageInfoVersioner
    Arguments:
      package_info_path: '%RECIPE_CACHE_DIR%/unpack/%PAYLOAD_VERSION_PKG%/PackageInfo'

  - Processor: com.github.jazzace.processors/TextSearcher
    Arguments:
      re_pattern: .*([1-9][0-9]*)_.*
      text_in: '%pkg_id%'
      result_output_var_name: volume_version

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%_Vol%volume_version%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
