Description: |
  Downloads the latest version of RODE SoundField as a pkg,
  verifies the signature, extracts the version, and copies
  the pkg.

Identifier: com.github.davidbpirie.pkg.RODESoundField
MinimumVersion: 2.3.0
ParentRecipe: com.github.dataJAR-recipes.download.SoundField By RODE

Input:
  NAME: RODESoundField

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%RECIPE_CACHE_DIR%/%NAME%/*.pkg'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/unpack/*.pkg'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%found_filename%/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/Application Support/Avid/Audio/Plug-ins/SoundField By RODE.aaxplugin/Contents/Info.plist'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
