Description: |
  Downloads the latest version of Devolutions Remote Desktop Manager,
  verfies the source, then uploads the package to Jamf Pro.

  JSS_URL, API_USERNAME, and API_PASSWORD, and for non-cloud instances
  SMB_URL, SMB_USERNAME and SMB_PASSWORD, are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.

Identifier: com.github.davidbpirie.jamf-upload.DevolutionsRemoteDesktopManager
ParentRecipe: com.github.dataJAR-recipes.download.Remote Desktop Manager Free
MinimumVersion: 2.3.0

Input:
  NAME: DevolutionsRemoteDesktopManager
  JAMF_CATEGORY: Business
  JAMF_PKG_NAME: '%NAME%'
  JAMF_PKG_INFO: Remote Desktop Manager (RDM) centralizes all remote connections 
    on a single platform that is securely shared between users and across the 
    entire team. With support for hundreds of integrated technologies — including 
    multiple protocols and VPNs — along with built-in enterprise-grade password 
    management tools, global and granular-level access controls, and robust mobile 
    apps to complement desktop clients for Windows and Mac, RDM is a IT toolbox for 
    remote access. RDM empowers IT departments to drive security, speed and 
    productivity throughout the organization, while reducing inefficiency, cost and 
    risk.
  JAMF_PKG_NOTES: Uploaded by AutoPkg
  JAMF_PKG_OS_REQUIREMENTS: ''
  JAMF_PKG_PRIORITY: '10'
  JAMF_PKG_REBOOT_REQUIRED: 'False'
  JAMF_PKG_REPLACE: 'False'
  JAMF_PKG_REPLACE_METADATA: 'False'
  JAMF_PKG_REQUIRED_PROCESSOR: None
  JAMF_PKG_SEND_NOTIFICATION: 'False'
  JAMF_PKG_SUFFIX: 'pkg'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_name: '%JAMF_PKG_NAME%-%version%.%JAMF_PKG_SUFFIX%'
      pkg_path: '%pkg_path%'
      pkg_category: '%JAMF_CATEGORY%'
      pkg_info: '%JAMF_PKG_INFO%'
      pkg_notes: '%JAMF_PKG_NOTES%'
      pkg_priority: '%JAMF_PKG_PRIORITY%'
      reboot_required: '%JAMF_PKG_REBOOT_REQUIRED%'
      os_requirements: '%JAMF_PKG_OS_REQUIREMENTS%'
      required_processor: '%JAMF_PKG_REQUIRED_PROCESSOR%'
      send_notification: '%JAMF_PKG_SEND_NOTIFICATION%'
      replace_pkg: '%JAMF_PKG_REPLACE%'
      replace_pkg_metadata: '%JAMF_PKG_REPLACE_METADATA%'
