Description: |
  Creates a package that installs the Cisco Secure Client pkg via a
  postinstall script, applying a custom set of choices.

  Largely inspired (ie plagiarised with <3) from Graham Pugh's Cisco
  AnyConnect recipe com.github.grahampugh.recipes.pkg.CiscoAnyConnect.

  Package source DMG must be provided either as Input Variable PKG or
  via the -p parameter eg:
  autopkg run CiscoSecureClient.pkg -p "path/to/predeploy.dmg"

  CSC_LAUNCHATLOGIN_DISABLE if non-empty will disable Cisco Secure Client
  from automatically launching at login by running:
    acinstallhelper -launchAtLogin -disable

  CSC_DISABLEAUTOSTART if non-empty will disable Cisco Secure Client from
  automatically launching at login by running:
    /Applications/Cisco/Cisco\ Secure\ Client.app/Contents/MacOS/Cisco\ Secure\ Client disableAutoStart
  Use this instead of CSC_LAUNCHATLOGIN_DISABLE as of v5.1.5.

  CSC_TE_AGENT_CONNECTIONSTRING if non-empty will be registered by running:
    /Applications/Cisco/Cisco\ Secure\ Client\ -\ ThousandEyes\ Endpoint\ Agent.app/Contents/MacOS/csc_te_agent --register '%CSC_TE_AGENT_CONNECTIONSTRING%'

  APP_PKG is the sub-package to expand that contains the GUI app, which is
  used to determine the version. Use vpn_module.pkg for versions before 5.1.13.

  PKG_ID is the ID of the generated package.

  desired_choices is the list of pkg components you would like installed.
  Default is just the VPN component. To find all available choices, run:
  installer -showChoicesXML -pkg path/to/Cisco\ Secure\ Client.pkg

  PROFILES should be a path to a folder containing profile xml files for
  the desired services. An example is included with this recipe, with a
  single example.xml file under vpn. See the administrator guide at
  https://www.cisco.com/c/en/us/support/security/secure-client-5/model.html
  for more details on generating profile xml files.

  Additionally, support for installing a VPN management tunnel profile
  (VpnMgmtTunProfile.xml) is handled if
  %PROFILES%/vpn/MgmtTun/VpnMgmtTunProfile.xml is found

Identifier: com.github.davidbpirie.pkg.CiscoSecureClient
MinimumVersion: '2.3'

Input:
  NAME: Cisco Secure Client
  CSC_LAUNCHATLOGIN_DISABLE: ''
  CSC_DISABLEAUTOSTART: ''
  CSC_TE_AGENT_CONNECTIONSTRING: ''
  APP_PKG: gui_module.pkg
  PKG_ID: com.github.davidbpirie.CiscoSecureClient
  desired_choices:
    - choice_anyconnect_vpn
  PROFILES: '%RECIPE_DIR%/CiscoSecureClientProfiles'

Process:
  - Processor: PackageRequired

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        payload: '0775'
        scripts: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Copier
    Arguments:
      source_path: '%PROFILES%'
      destination_path: '%RECIPE_CACHE_DIR%/%NAME%/scripts/Profiles'
      overwrite: True

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%PKG%/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%/scripts/%NAME%.pkg'

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pkg_path%'
      skip_payload: False
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      purge_destination: True

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/%APP_PKG%/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/unpack-payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/unpack-payload/Applications/Cisco/Cisco Secure Client.app'
      plist_keys:
        CFBundleShortVersionString: version

  - Processor: com.github.grahampugh.recipes.commonprocessors/ChoicesXMLGenerator
    Arguments:
      choices_pkg_path: '%pkg_path%'
      choices_xml_dest: '%RECIPE_CACHE_DIR%/%NAME%/scripts/choices.xml'

  - Processor: FileCreator
    Arguments:
      file_content: |
        #!/bin/zsh

        ################################################################################
        #
        # Runs the Cisco Secure Client uninstall script (if it is found) before installing
        #
        ################################################################################

        if [ -f /opt/cisco/secureclient/bin/cisco_secure_client_uninstall.sh ]; then
          /opt/cisco/secureclient/bin/cisco_secure_client_uninstall.sh
        fi
        exit 0
      file_mode: '0755'
      file_path: '%RECIPE_CACHE_DIR%/%NAME%/scripts/preinstall'

  - Processor: FileCreator
    Arguments:
      file_content: |
        #!/bin/zsh

        ################################################################################
        #
        # Installs the Cisco Secure Client package, applying the choices.xml choices files.
        # Also copies Profiles/vpn/MgmtTun/VpnMgmtTunProfile.xml file into place to
        # /opt/cisco/secureclient/vpn/profile/mgmttun/VpnMgmtTunProfile.xml if found.
        #
        ################################################################################

        ROOT_DIR="$( cd -- "$(/usr/bin/dirname "$0")"; pwd -P )"
        CSC_DIR=/opt/cisco/secureclient
        SRC_MGMT_PROFILE="${ROOT_DIR}/Profiles/vpn/MgmtTun/VpnMgmtTunProfile.xml"
        DST_MGMT_PROFILE="${CSC_DIR}/vpn/profile/mgmttun/VpnMgmtTunProfile.xml"
        AC_INSTALL_HELPER="${CSC_DIR}/bin/acinstallhelper"
        CSC_APP_DIR="/Applications/Cisco/Cisco Secure Client.app"
        CSC_APP_BINARY="${CSC_APP_DIR}/Contents/MacOS/Cisco Secure Client"
        CSC_TE_APP_DIR="/Applications/Cisco/Cisco Secure Client - ThousandEyes Endpoint Agent.app"
        CSC_TE_AGENT_BINARY="${CSC_TE_APP_DIR}/Contents/MacOS/csc_te_agent"

        /usr/sbin/installer -applyChoiceChangesXML "${ROOT_DIR}/choices.xml" -pkg "${ROOT_DIR}/%NAME%.pkg" -target /
        EXIT_RESULT=$?

        if [ -e "${SRC_MGMT_PROFILE}" ]; then
          echo "Copying Cisco Secure Client management VPN profile from ${SRC_MGMT_PROFILE} to ${DST_MGMT_PROFILE}"
          /bin/cp "${SRC_MGMT_PROFILE}" "${DST_MGMT_PROFILE}"
        fi

        if [ ! -z "%CSC_LAUNCHATLOGIN_DISABLE%" ]; then
          echo "Disabling Cisco Secure Client Launch at Login feature"
          "${AC_INSTALL_HELPER}" -launchAtLogin -disable 2>/dev/null
        fi

        if [ ! -z "%CSC_DISABLEAUTOSTART%" ]; then
          echo "Disabling Cisco Secure Client AutoStart feature"
          "${CSC_APP_BINARY}" disableAutoStart
        fi

        if [ ! -z "%CSC_TE_AGENT_CONNECTIONSTRING%" ]; then
          echo "Registering ThousandEyes Agent"
          "${CSC_TE_AGENT_BINARY}" --register "%CSC_TE_AGENT_CONNECTIONSTRING%"
        fi

        exit ${EXIT_RESULT}
      file_mode: '0755'
      file_path: '%RECIPE_CACHE_DIR%/%NAME%/scripts/postinstall'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown: []
        id: '%PKG_ID%'
        options: purge_ds_store
        pkgname: '%NAME%-%version%'
        pkgroot: '%RECIPE_CACHE_DIR%/%NAME%/payload'
        scripts: '%RECIPE_CACHE_DIR%/%NAME%/scripts'
        version: '%version%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/%NAME%'
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/unpack-payload'
