<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Audacity as a DMG, then imports it to Munki.</string>
		<key>Identifier</key>
		<string>com.github.davidbpirie.munki.audacity</string>
		<key>MinimumVersion</key>
		<string>2.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.ahousseini-recipes.download.Audacity</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Audacity</string>
			<key>MUNKI_DISPLAYNAME</key>
			<string>Audacity</string>
			<key>MUNKI_DESCRIPTION</key>
			<string>Audacity is a free, easy-to-use, multi-track audio editor and recorder for Windows, Mac OS X, GNU/Linux and other operating systems.</string>
			<key>MUNKI_CATEGORY</key>
			<string>Productivity</string>
			<key>MUNKI_DEVELOPER</key>
			<string>Audacity</string>
			<key>MUNKI_MINIMUM_OS_VERSION</key>
			<string>10.13.0</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%</string>
			<key>pkginfo</key>
			<dict>
				<key>name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>developer</key>
				<string>%MUNKI_DEVELOPER%</string>
				<key>blocking_applications</key>
				<array>
					<string>Audacity.app</string>
				</array>
				<key>catalogs</key>
				<array>
					<string>dev</string>
				</array>
				<key>description</key>
				<string>%MUNKI_DESCRIPTION%</string>
				<key>display_name</key>
				<string>%MUNKI_DISPLAYNAME%</string>
				<key>minimum_os_version</key>
				<string>%MUNKI_MINIMUM_OS_VERSION%</string>
				<key>unattended_install</key>
				<true />
			</dict>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
					<key>pkg_path</key>
					<string>%pathname%</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>