Description: Downloads the latest version of Audacity as a DMG, then imports it to Munki.
Identifier: com.github.davidbpirie.munki.audacity
ParentRecipe: com.github.ahousseini-recipes.download.Audacity
MinimumVersion: 2.3.0

Input:
  NAME: Audacity
  MUNKI_DISPLAYNAME: Audacity
  MUNKI_DESCRIPTION: Audacity is a free, easy-to-use, multi-track audio editor and recorder for Windows, Mac OS X, GNU/Linux and other operating systems.
  MUNKI_CATEGORY: Music
  MUNKI_DEVELOPER: Audacity
  MUNKI_MINIMUM_OS_VERSION: 10.13.0
  MUNKI_REPO_SUBDIR: '%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%'
  pkginfo:
    blocking_applications:
    - Audacity.app
    catalogs:
    - testing
    category: '%MUNKI_CATEGORY%'
    description: '%MUNKI_DESCRIPTION%'
    developer: '%MUNKI_DEVELOPER%'
    display_name: '%MUNKI_DISPLAYNAME%'
    minimum_os_version: '%MUNKI_MINIMUM_OS_VERSION%'
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
