Description: |
  Copies the Mac Evaluation Utility package from the source DMG,
  verifying the signature and extracting the version, then uploads
  the package to Jamf Pro.

  Package source DMG must be manually downloaded from https://beta.apple.com/it,
  and then provided either as Input Variable PKG or via the -p parameter eg:
  autopkg run MacEvaluationUtility.jamf-upload -p "path/to/Mac_Evaluation_Utility_4_5.dmg"

  JSS_URL, API_USERNAME, and API_PASSWORD, and for non-cloud instances
  SMB_URL, SMB_USERNAME and SMB_PASSWORD, are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.

Identifier: com.github.davidbpirie.jamf-upload.MacEvaluationUtility
ParentRecipe: com.github.davidbpirie.pkg.MacEvaluationUtility
MinimumVersion: 2.3.0

Input:
  NAME: MacEvaluationUtility
  JAMF_CATEGORY: Utilities
  JAMF_PKG_NAME: '%NAME%'
  JAMF_PKG_INFO: |
    Mac Evaluation Utility evaluates your organization's ability to 
    deploy Mac computers. The app checks the network to help 
    verify that critical hosts and services are reachable for 
    essential services like Automated Device Enrollment and 
    software updates. It also examines the device's management 
    configuration to help make sure you're aligned with best 
    practices. The results can be shared with colleagues to help 
    you build a plan to succeed at deploying Mac computers at scale.
  JAMF_PKG_NOTES: Uploaded by AutoPkg
  JAMF_PKG_OS_REQUIREMENTS: ''
  JAMF_PKG_PRIORITY: '10'
  JAMF_PKG_REBOOT_REQUIRED: 'False'
  JAMF_PKG_REPLACE: 'False'
  JAMF_PKG_REPLACE_METADATA: 'False'
  JAMF_PKG_REQUIRED_PROCESSOR: None
  JAMF_PKG_SEND_NOTIFICATION: 'False'
  JAMF_PKG_SUFFIX: 'pkg'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_name: '%JAMF_PKG_NAME%-%version%.%JAMF_PKG_SUFFIX%'
      pkg_path: '%pkg_path%'
      pkg_category: '%JAMF_CATEGORY%'
      pkg_info: '%JAMF_PKG_INFO%'
      pkg_notes: '%JAMF_PKG_NOTES%'
      pkg_priority: '%JAMF_PKG_PRIORITY%'
      reboot_required: '%JAMF_PKG_REBOOT_REQUIRED%'
      os_requirements: '%JAMF_PKG_OS_REQUIREMENTS%'
      required_processor: '%JAMF_PKG_REQUIRED_PROCESSOR%'
      send_notification: '%JAMF_PKG_SEND_NOTIFICATION%'
      replace_pkg: '%JAMF_PKG_REPLACE%'
      replace_pkg_metadata: '%JAMF_PKG_REPLACE_METADATA%'
