Description: |
  Copies the Mac Evaluation Utility package from the source DMG,
  verifying the signature and extracting the version.

  Package source DMG must be manually downloaded from https://beta.apple.com/it,
  and then provided either as Input Variable PKG or via the -p parameter eg:
  autopkg run MacEvaluationUtility.pkg -p "path/to/Mac_Evaluation_Utility_4_5.dmg"

Identifier: com.github.davidbpirie.pkg.MacEvaluationUtility
MinimumVersion: 2.3.0

Input:
  NAME: MacEvaluationUtility

Process:
  - Processor: PackageRequired

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%PKG%/*.pkg"
      expected_authority_names:
        - Software Update
        - Apple Software Update Certification Authority
        - Apple Root CA

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: "%PKG%/*.pkg"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      purge_destination: True

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/MacEvaluationUtility.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/Applications/Mac Evaluation Utility.app'

  - Processor: PkgCopier
    Arguments:
      source_pkg: "%PKG%/*.pkg"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"

  - Processor: PathDeleter
    Arguments:
      path_list:
      - '%RECIPE_CACHE_DIR%/unpack'
      - '%RECIPE_CACHE_DIR%/payload'