Description: |
  Copies the Melodyne package from the source DMG, verifying the
  signature and extracting the version.

  Package source DMG must be manually downloaded, then provided
  either as Input Variable PKG or via the -p parameter eg:
  autopkg run CelemonyMelodyne.pkg -p "path/to/Melodyne.5.4.2.006.dmg"

Identifier: com.github.davidbpirie.pkg.CelemonyMelodyne
MinimumVersion: 2.3.0

Input:
  NAME: CelemonyMelodyne

Process:
  - Processor: PackageRequired

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%PKG%/*.pkg'
      expected_authority_names:
        - 'Developer ID Installer: Celemony Software GmbH (D884PTXG4Y)'
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%PKG%/*.pkg'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/com.celemony.melodyne.standalone.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/payload/Applications/Melodyne */Melodyne.app'

  - Processor: PlistReader
    Arguments:
      info_path: '%found_filename%'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%PKG%/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
