Description: |
  Downloads the latest version of DFU Blaster as a dmg, verifies the
  code signature, then finds the version.

Identifier: com.github.davidbpirie.pkg.DFUBlaster
ParentRecipe: com.github.kevinmcox.download.DFUBlaster
MinimumVersion: 2.3.0

Input:
  NAME: DFUBlaster

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pathname%/DFU Blaster Pro.pkg'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/DFU_Blaster_Pro.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/Applications/DFU Blaster Pro.app'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
