Description: Downloads the latest version of OBSBOT WebCam, then builds a package.
Identifier: com.github.davidbpirie.pkg.OBSBOTWebCam
ParentRecipe: com.github.davidbpirie.download.OBSBOTWebCam
MinimumVersion: 2.3.0

Input:
  NAME: OBSBOTWebCam
  PKG_ID: com.obsbot.OBSBOTWebCam.pkg

Process:
- Processor: AppPkgCreator
  Arguments:
    bundleid: '%PKG_ID%'