Description: |
  Downloads the latest version of Massey Plugins AAX Installer,
  expands the zip archive, verifies the app signature, then
  creates a package to install the installer app.

Identifier: com.github.davidbpirie.pkg.MasseyPluginsAAXInstaller
ParentRecipe: com.github.davidbpirie.download.MasseyPluginsAAXInstaller
MinimumVersion: 2.3.0

Input:
  NAME: MasseyPluginsAAXInstaller

Process:
  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unzip'
      purge_destination: True

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unzip/Massey Plugins AAX Installer.app'
      requirement: anchor apple generic and identifier "com.massey.wizard" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2U4227CZV5")

  - Processor: AppPkgCreator
    Arguments:
      app_path: '%RECIPE_CACHE_DIR%/unzip/Massey Plugins AAX Installer.app'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unzip'
