Description: |
  Downloads the latest version of The Cargo Cult Spanner 3.

Identifier: com.github.davidbpirie.download.TheCargoCultSpanner3
MinimumVersion: 2.3.0

Input:
  NAME: TheCargoCultSpanner3
  SEARCH_RE: href="([^"]*?\.zip)"[^>]*?>Spanner 3
  SEARCH_URL: https://www.thecargocult.nz/downloads

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%SEARCH_RE%'
      url: '%SEARCH_URL%'
      result_output_var_name: download_url

  - Processor: URLDownloader
    Arguments:
      url: '%download_url%'

  - Processor: EndOfCheckPhase
