Description: |
  Downloads the latest version of The Cargo Cult Spanner 4, then
  expands the archive, extracts the version and verifies the
  signature, and copies the pkg.

Identifier: com.github.davidbpirie.pkg.TheCargoCultSpanner4
ParentRecipe: com.github.davidbpirie.download.TheCargoCultSpanner4
MinimumVersion: 2.3.0

Input:
  NAME: TheCargoCultSpanner4

Process:
  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unzip'
      purge_destination: True

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unzip/*.pkg'
      expected_authority_names:
        - 'Developer ID Installer: maggot software (5D56NUSPPZ)'
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%RECIPE_CACHE_DIR%/unzip/*.pkg'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Spanner.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/Library/Application Support/Avid/Audio/Plug-Ins/Spanner.aaxplugin/Contents/Info.plist'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%RECIPE_CACHE_DIR%/unzip/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unzip'
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
