Description: Downloads the latest version of GameMaker as a pkg, then finds the version.
Identifier: com.github.davidbpirie.pkg.GameMaker
ParentRecipe: com.github.davidbpirie.download.GameMaker
MinimumVersion: 2.3.0

Input:
  NAME: GameMaker

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: <a href="http[^"]*-([0-9][0-9.]*)\.pkg"
    result_output_var_name: version
    url: '%BASE_URL%'

- Processor: PkgCopier
  Arguments:
    source_pkg: '%pathname%'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
