Description: |
  Downloads the latest version of ComfyUI, verifies the signature,
  then builds a package.
Identifier: com.github.davidbpirie.pkg.ComfyUI
ParentRecipe: com.github.davidbpirie.download.ComfyUI
MinimumVersion: 2.3.0

Input:
  NAME: ComfyUI

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%pathname%/ComfyUI.app'
