Description: |
  Downloads the latest version of Google Santa from GitHub,
  then extracts the pkg and finds the version.
Identifier: com.github.davidbpirie.pkg.GoogleSanta
ParentRecipe: com.github.davidbpirie.download.GoogleSanta
MinimumVersion: 2.3.0

Input:
  NAME: GoogleSanta

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    flat_pkg_path: '%pathname%/santa-*.pkg'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'

- Processor: PkgPayloadUnpacker
  Arguments:
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/app.pkg/Payload'
    destination_path: '%RECIPE_CACHE_DIR%/payload'
    purge_destination: True

- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/payload/Applications/Santa.app'

- Processor: PkgCopier
  Arguments:
    source_pkg: '%pathname%/santa-*.pkg'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
    - '%RECIPE_CACHE_DIR%/payload'
