Description: |
  Downloads latest version of DaVinci Resolve disk image, then
  copies the package from the DMG, extracting the version.

  This product requires registration in order to download, so
  you _must_ override all input variables beginning with 'REG_'
  and they must contain data.

  Notably, REG_COUNTRY must contain sane values:
  - REG_COUNTRY is of the form 'us', 'ca', etc.

Identifier: com.github.davidbpirie.pkg.BlackmagicDaVinciResolve
ParentRecipe: com.github.davidbpirie.download.BlackmagicDaVinciResolve
MinimumVersion: 2.3.0

Input:
  NAME: BlackmagicDaVinciResolve
  PRODUCT_MAJOR_VERSION: '17'
  PRODUCT_NAME_PATTERN: '^DaVinci Resolve (?P&lt;version&gt;%PRODUCT_MAJOR_VERSION%(\.\d+)*)( Update)*$'

Process:
  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unzip'
      purge_destination: True

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/unzip/*.dmg'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%found_filename%/*.pkg'
      expected_authority_names:
        - 'Developer ID Installer: Blackmagic Design Inc (9ZGFBWLSYP)'
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%found_filename%/*.pkg'
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      purge_destination: True

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Manifest.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/Applications/DaVinci Resolve/DaVinci Resolve.app'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%found_filename%/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
      - '%RECIPE_CACHE_DIR%/unzip'
      - '%RECIPE_CACHE_DIR%/unpack'
      - '%RECIPE_CACHE_DIR%/payload'
