Description: |
  Downloads latest version of Blackmagic Video Assist disk image, then
  copies the package from the DMG.

  This product requires registration in order to download, so
  you _must_ override all input variables beginning with 'REG_'
  and they must contain data.

  Notably, REG_COUNTRY must contain sane values:
  - REG_COUNTRY is of the form 'us', 'ca', etc.

Identifier: com.github.davidbpirie.pkg.BlackmagicVideoAssist
ParentRecipe: com.github.davidbpirie.download.BlackmagicVideoAssist
MinimumVersion: 2.3.0

Input:
  NAME: BlackmagicVideoAssist

Process:
  - Processor: PkgCopier
    Arguments:
      source_pkg: '%found_filename%/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unzip'
