Description: |
  Downloads latest version of DaVinci Resolve Studio disk image, then
  copies the package from the DMG, extracting the version.

  This product requires registration in order to download, so
  you _must_ override all input variables beginning with 'REG_'
  and they must contain data.

  Notably, REG_COUNTRY must contain sane values:
  - REG_COUNTRY is of the form 'us', 'ca', etc.

Identifier: com.github.davidbpirie.pkg.BlackmagicDaVinciResolveStudio
ParentRecipe: com.github.davidbpirie.download.BlackmagicDaVinciResolveStudio
MinimumVersion: 2.3.0

Input:
  NAME: BlackmagicDaVinciResolveStudio
  APP_PKG_NAME: Manifest.pkg
  PRODUCT_MAJOR_VERSION: '18'
  PRODUCT_NAME_PATTERN: '^DaVinci Resolve Studio (?P<version>%PRODUCT_MAJOR_VERSION%(\.\d+)*)( Update)*$'

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%found_filename%/*.pkg'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      purge_destination: True

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/%APP_PKG_NAME%/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/Applications/DaVinci Resolve/DaVinci Resolve.app'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%found_filename%/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unzip'
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
