Description: |
  Downloads latest version of DaVinci Resolve disk image, then
  copies the package from the DMG, extracting the version, then
  uploads the package to Jamf Pro.

  This product requires registration in order to download, so
  you _must_ override all input variables beginning with 'REG_'
  and they must contain data.

  Notably, REG_COUNTRY must contain sane values:
  - REG_COUNTRY is of the form 'us', 'ca', etc.

  JSS_URL, API_USERNAME, and API_PASSWORD, and for non-cloud instances
  SMB_URL, SMB_USERNAME and SMB_PASSWORD, are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.

Identifier: com.github.davidbpirie.jamf-upload.davinciresolve
ParentRecipe: com.github.davidbpirie.pkg.davinciresolve
MinimumVersion: 2.3.0

Input:
  NAME: DaVinciResolve
  PRODUCT_MAJOR_VERSION: '17'
  PRODUCT_NAME_PATTERN: '^DaVinci Resolve (?P&lt;version&gt;%PRODUCT_MAJOR_VERSION%(\.\d+)*)( Update)*$'
  JAMF_CATEGORY: Photo & Video
  JAMF_PKG_NAME: '%NAME%'
  JAMF_PKG_INFO: This software installs the free version of DaVinci Resolve %PRODUCT_MAJOR_VERSION%
    which features up to 10x faster editing performance, Fairlight audio post production,
    dozens of new filters and effects and more. Technical support is available via the
    Blackmagic Design community forums.
  JAMF_PKG_NOTES: Uploaded by AutoPkg
  JAMF_PKG_OS_REQUIREMENTS: ''
  JAMF_PKG_PRIORITY: '10'
  JAMF_PKG_REBOOT_REQUIRED: 'False'
  JAMF_PKG_REPLACE: 'False'
  JAMF_PKG_REPLACE_METADATA: 'False'
  JAMF_PKG_REQUIRED_PROCESSOR: None
  JAMF_PKG_SEND_NOTIFICATION: 'False'
  JAMF_PKG_SUFFIX: 'pkg'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_name: '%JAMF_PKG_NAME%-%version%.%JAMF_PKG_SUFFIX%'
      pkg_path: '%pkg_path%'
      pkg_category: '%JAMF_CATEGORY%'
      pkg_info: '%JAMF_PKG_INFO%'
      pkg_notes: '%JAMF_PKG_NOTES%'
      pkg_priority: '%JAMF_PKG_PRIORITY%'
      reboot_required: '%JAMF_PKG_REBOOT_REQUIRED%'
      os_requirements: '%JAMF_PKG_OS_REQUIREMENTS%'
      required_processor: '%JAMF_PKG_REQUIRED_PROCESSOR%'
      send_notification: '%JAMF_PKG_SEND_NOTIFICATION%'
      replace_pkg: '%JAMF_PKG_REPLACE%'
      replace_pkg_metadata: '%JAMF_PKG_REPLACE_METADATA%'
