Description: Downloads the latest AirPort Utility installer from Apple Support.
Identifier: com.github.davidbpirie.download.AirPortUtility
MinimumVersion: 2.3.0

Input:
  NAME: AirPortUtility
  LOCALE: en_AU

Process:
- Processor: URLDownloader
  Arguments:
    url: 'https://updates.cdn-apple.com/2019/cert/041-90809-20191028-de07bcac-151f-4c5f-9626-1ba7d0db1a49/AirPortUtility.dmg'

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - Software Update
    - Apple Software Update Certification Authority
    - Apple Root CA
    input_path: '%pathname%/AirPortUtility.pkg'
