Description: |
  Downloads the latest version of Allen & Heath SQ MixPad as a
  zip archive, then extracts the dmg and verifies the code
  signature.

Identifier: com.github.davidbpirie.download.AllenAndHeathSQMixPad
MinimumVersion: 2.3.0

Input:
  NAME: AllenAndHeathSQMixPad
  SEARCH_RE: <option value="([^"]*)" data-compat="macOS[^"]*">
  SEARCH_URL: https://www.allen-heath.com/hardware/sq/sq-mixpad/

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%SEARCH_RE%'
      url: '%SEARCH_URL%'
      result_output_var_name: download_url

  - Processor: URLDownloader
    Arguments:
      url: '%download_url%'

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unzip'
      purge_destination: True

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/unzip/*.dmg'

  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: '%found_filename%'

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%found_filename%/%app_name%'
      requirement: identifier "com.allenheath.SQU.MixPad" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7SGLXZYF29"
