Description: |
  Downloads the latest version of Allen & Heath SQ MixPad as a
  zip archive, extracts the dmg and verifies the code signature,
  then creates a pkg.

Identifier: com.github.davidbpirie.pkg.AllenAndHeathSQMixPad
ParentRecipe: com.github.davidbpirie.download.AllenAndHeathSQMixPad
MinimumVersion: 2.3.0

Input:
  NAME: AllenAndHeathSQMixPad

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: '%found_filename%/%app_name%'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
