Description: |
  Creates a pkg for Allen & Heath custom Control Editor from a source dmg,
  extracting the version and verifying the signature, then uploads the
  package to Jamf Pro.

  Package source dmg file must be manually downloaded from Allen and Heath,
  then provided either as Input Variable PKG or via the -p parameter eg:
  autopkg run AllenHeathCustomControlEditor.jamf-upload -p "path/to/Custom-Control-Editor-1.5.0.dmg"

  JSS_URL, API_USERNAME, and API_PASSWORD, and for non-cloud instances
  SMB_URL, SMB_USERNAME and SMB_PASSWORD, are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.

Identifier: com.github.davidbpirie.jamf-upload.AllenHeathCustomControlEditor
ParentRecipe: com.github.davidbpirie.pkg.AllenHeathCustomControlEditor
MinimumVersion: 2.3.0

Input:
  NAME: AllenHeathCustomControlEditor
  JAMF_CATEGORY: Music
  JAMF_PKG_NAME: '%NAME%'
  JAMF_PKG_INFO: Custom Control is a customizable, cross-platform control app, providing elegant, bespoke control over Allen & Heath AHM, Avantis and dLive installed audio systems. The design of the app interface is via Custom Control editor software. Access to all levels, mutes and sends is provided, together with preset recall, source selection and metering. Tabs can be configured for easy access to multiple control pages or zones. A library of control designs is provided, with the option to add custom graphics to match the venue. Once complete, the configuration is uploaded to the AHM processor, Avantis or dLive MixRack, ready for deployment.
  JAMF_PKG_NOTES: Created and uploaded by AutoPkg
  JAMF_PKG_OS_REQUIREMENTS: ''
  JAMF_PKG_PRIORITY: '10'
  JAMF_PKG_REBOOT_REQUIRED: 'False'
  JAMF_PKG_REPLACE: 'False'
  JAMF_PKG_REPLACE_METADATA: 'False'
  JAMF_PKG_REQUIRED_PROCESSOR: None
  JAMF_PKG_SEND_NOTIFICATION: 'False'
  JAMF_PKG_SUFFIX: 'pkg'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_name: '%JAMF_PKG_NAME%-%version%.%JAMF_PKG_SUFFIX%'
      pkg_path: '%pkg_path%'
      pkg_category: '%JAMF_CATEGORY%'
      pkg_info: '%JAMF_PKG_INFO%'
      pkg_notes: '%JAMF_PKG_NOTES%'
      pkg_priority: '%JAMF_PKG_PRIORITY%'
      reboot_required: '%JAMF_PKG_REBOOT_REQUIRED%'
      os_requirements: '%JAMF_PKG_OS_REQUIREMENTS%'
      required_processor: '%JAMF_PKG_REQUIRED_PROCESSOR%'
      send_notification: '%JAMF_PKG_SEND_NOTIFICATION%'
      replace_pkg: '%JAMF_PKG_REPLACE%'
      replace_pkg_metadata: '%JAMF_PKG_REPLACE_METADATA%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%pkg_path%'
