Description: |
  Copies the EUCON Workstation Unified installer pkg from the source DMG,
  verifying the signature, extracts the version of the WSControlApp from
  the included WSControl.pkg, then creates a package that installs the
  pkg via a postinstall script, applying a custom set of choices.

  Package source DMG must be manually downloaded from Avid, then provided
  either as Input Variable PKG or via the -p parameter eg:
  autopkg run AvidProToolsWSControl.pkg -p "path/to/EUCON_WorkstationUnifiedInstallMac_2025_6_0_60.dmg"

Identifier: com.github.davidbpirie.pkg.AvidProToolsWSControl
MinimumVersion: 2.3.0

Input:
  NAME: AvidProToolsWSControl
  PKG_ID: com.github.davidbpirie.AvidProToolsWSControl

Process:
  - Processor: PackageRequired

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%PKG%/*.pkg'
      expected_authority_names:
        - 'Developer ID Installer: Avid Technology Inc (4UYUA773XD)'
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        payload: '0775'
        scripts: '0775'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%PKG%/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%/scripts/%NAME%.pkg'

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pkg_path%'
      skip_payload: False
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      purge_destination: True

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/WSControl.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/unpack-payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/unpack-payload/Applications/WSControlApp.app'
      plist_keys:
        CFBundleShortVersionString: version

  - Processor: com.github.grahampugh.recipes.commonprocessors/ChoicesXMLGenerator
    Arguments:
      choices_pkg_path: '%pkg_path%'
      choices_xml_dest: '%RECIPE_CACHE_DIR%/%NAME%/scripts/choices.xml'
      desired_choices:
        - choiceInstallS6Workstation

  - Processor: FileCreator
    Arguments:
      file_content: |
        #!/bin/zsh

        ################################################################################
        #
        # Installs the Avid EUCON Workstation Unified Install package, applying the
        # choices.xml choices files.
        #
        ################################################################################

        ROOT_DIR="$( cd -- "$(/usr/bin/dirname "$0")"; pwd -P )"

        /usr/sbin/installer -applyChoiceChangesXML "${ROOT_DIR}/choices.xml" -pkg "${ROOT_DIR}/%NAME%.pkg" -target /
        exit $?
      file_mode: '0755'
      file_path: '%RECIPE_CACHE_DIR%/%NAME%/scripts/postinstall'

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown: []
        id: '%PKG_ID%'
        options: purge_ds_store
        pkgname: '%NAME%-%version%'
        pkgroot: '%RECIPE_CACHE_DIR%/%NAME%/payload'
        scripts: '%RECIPE_CACHE_DIR%/%NAME%/scripts'
        version: '%version%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/unpack-payload'
