Description: |
  Copies the Sibelius package from the source DMG, verifying the signature and
  extracting the version.

  Package source DMG must be manually downloaded from Avid, and then provided
  either as Input Variable PKG or via the -p parameter eg:
  autopkg run AvidSibelius.pkg -p "path/to/Sibelius_2023.11.1_Mac.dmg"

Identifier: com.github.davidbpirie.pkg.AvidSibelius
MinimumVersion: 2.3.0

Input:
  NAME: AvidSibelius

Process:
  - Processor: PackageRequired

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%PKG%/*.pkg"
      expected_authority_names:
        - 'Developer ID Installer: Avid Technology Inc (4UYUA773XD)'
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: "%PKG%/*.pkg"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      purge_destination: True

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Sibelius.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/Applications/Sibelius.app'

  - Processor: PkgCopier
    Arguments:
      source_pkg: "%PKG%/*.pkg"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"

  - Processor: PathDeleter
    Arguments:
      path_list:
      - '%RECIPE_CACHE_DIR%/unpack'
      - '%RECIPE_CACHE_DIR%/payload'