Description: |
  Copies the Sibelius Licence Server pkg from the source DMG, verifying the
  signature and extracting the version.

  Package source DMG must be manually downloaded from Avid, then provided
  either as Input Variable PKG or via the -p parameter eg:
  autopkg run AvidSibelius.pkg -p "path/to/Sibelius_Licence_Server_8.4.2_Mac.dmg"

Identifier: com.github.davidbpirie.pkg.AvidSibeliusLicenceServer
MinimumVersion: 2.3.0

Input:
  NAME: AvidSibeliusLicenceServer

Process:
  - Processor: PackageRequired

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%PKG%/*.pkg'
      expected_authority_names:
        - 'Developer ID Installer: Avid Technology Inc (4UYUA773XD)'
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%PKG%/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%/scripts/%NAME%.pkg'

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pkg_path%'
      skip_payload: False
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      purge_destination: True

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/LicenceServer.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/unpack-payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/unpack-payload/Applications/Sibelius Licence Server/Sibelius Licence Server Control Panel.app'
      plist_keys:
        CFBundleVersion: version

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/unpack-payload'
