Description: |
  Copies the Sibelius pkg from the source DMG, verifying the signature and
  extracting the version, then creates a package that installs the Sibelius
  pkg via a postinstall script, applying a custom set of choices, then
  uploads the package to Jamf Pro and deletes the package.

  Package source DMG must be manually downloaded from Avid, then provided
  either as Input Variable PKG or via the -p parameter eg:
  via the -p parameter eg:
  autopkg run AvidSibelius.jamf-upload -p "path/to/Sibelius_2023.11.1_Mac.dmg"

  PKG_ID is the ID of the generated package.

  desired_choices is the list of pkg components you would like installed.
  To find all available choices, run:
  installer -showChoicesXML -pkg path/to/Install Sibelius.pkg

  JSS_URL, API_USERNAME, and API_PASSWORD, and for non-cloud instances
  SMB_URL, SMB_USERNAME and SMB_PASSWORD, are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.

Identifier: com.github.davidbpirie.jamf-upload.AvidSibelius
ParentRecipe: com.github.davidbpirie.pkg.AvidSibelius
MinimumVersion: 2.3.0

Input:
  NAME: AvidSibelius
  JAMF_CATEGORY: Music
  JAMF_PKG_NAME: '%NAME%'
  JAMF_PKG_INFO: Create beautiful, captivating scores more quickly than ever before with the world's best selling notation software.
  JAMF_PKG_NOTES: Uploaded by AutoPkg
  JAMF_PKG_OS_REQUIREMENTS: ''
  JAMF_PKG_PRIORITY: '10'
  JAMF_PKG_REBOOT_REQUIRED: 'False'
  JAMF_PKG_REPLACE: 'False'
  JAMF_PKG_REPLACE_METADATA: 'False'
  JAMF_PKG_REQUIRED_PROCESSOR: None
  JAMF_PKG_SEND_NOTIFICATION: 'False'
  JAMF_PKG_SUFFIX: 'pkg'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_name: '%JAMF_PKG_NAME%-%version%.%JAMF_PKG_SUFFIX%'
      pkg_path: '%pkg_path%'
      pkg_category: '%JAMF_CATEGORY%'
      pkg_info: '%JAMF_PKG_INFO%'
      pkg_notes: '%JAMF_PKG_NOTES%'
      pkg_priority: '%JAMF_PKG_PRIORITY%'
      reboot_required: '%JAMF_PKG_REBOOT_REQUIRED%'
      os_requirements: '%JAMF_PKG_OS_REQUIREMENTS%'
      required_processor: '%JAMF_PKG_REQUIRED_PROCESSOR%'
      send_notification: '%JAMF_PKG_SEND_NOTIFICATION%'
      replace_pkg: '%JAMF_PKG_REPLACE%'
      replace_pkg_metadata: '%JAMF_PKG_REPLACE_METADATA%'

  - Processor: PathDeleter
    Arguments:
      path_list:
      - '%pkg_path%'
