Description: |
  Downloads the latest release of calibrite PROFILER as a dmg,
  verifies the signature and extracts the version, then generates a pkg.
Identifier: com.github.davidbpirie.pkg.calibritePROFILER
ParentRecipe: com.github.davidbpirie.download.calibritePROFILER
MinimumVersion: 2.3.0

Input:
  NAME: calibritePROFILER

Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%pathname%/%app_name%'
