Description: |
  Downloads the AdobeUninstaller tool, verifies the signature and
  extracts the version.
Identifier: com.github.davidbpirie.download.AdobeUninstaller
MinimumVersion: 2.3.0

Input:
  NAME: AdobeUninstaller
  DOWNLOAD_URL: https://deploymenttools.acp.adobeoobe.com/Uninstall/Mac/AdobeUninstaller.dmg

Process:
  - Processor: URLDownloader
    Arguments:
      url: '%DOWNLOAD_URL%'

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/AdobeUninstaller'
      requirement: anchor apple generic and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JQ525L2MZD)