Description: |
  Downloads the AdobeUninstaller tool, verifies the signature and
  extracts the version, then builds a package installing it into
  /usr/local/bin.

  Note that version must be provided manually e.g.:
    autopkg run -v AdobeUninstaller.pkg -k version=1.0.0.7
  You can get the correct version from the AdobeUninstaller binary by
  running:
    sudo /path/to/AdobeUninstaller --version

Identifier: com.github.davidbpirie.pkg.AdobeUninstaller
MinimumVersion: 2.3.0
ParentRecipe: com.github.davidbpirie.download.AdobeUninstaller

Input:
  NAME: AdobeUninstaller
  PKG_ID: com.github.davidbpirie.pkg.AdobeUninstaller
  version: Provide_version_manually

Process:
  - Processor: StopProcessingIf
    Arguments:
      predicate: version == "Provide_version_manually"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        usr: '0755'
        usr/local: '0755'
        usr/local/bin: '0755'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

  - Processor: Copier
    Arguments:
      source_path: '%pathname%/AdobeUninstaller'
      destination_path: '%pkgroot%/usr/local/bin/AdobeUninstaller'
      overwrite: true

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
        - path: usr
          user: root
          group: wheel
          mode: '0755'
        - path: usr/local
          user: root
          group: admin
          mode: '0755'
        - path: usr/local/bin
          user: root
          group: wheel
          mode: '0755'
        - path: usr/local/bin/AdobeUninstaller
          user: root
          group: wheel
          mode: '0755'
        id: '%PKG_ID%'
        options: purge_ds_store
        pkgname: '%NAME%-%version%'
        pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'
        version: '%version%'

  - Processor: PathDeleter
    Arguments:
      path_list:
      - '%RECIPE_CACHE_DIR%/%NAME%'
