Description: |
  Downloads the current release pkg of MunkiReportPython2 from Github,
  then imports to munki.
  Set PRERELEASE to a non-empty string to download prereleases, either
  via Input in an override or via the -k option,
  i.e.: `-k PRERELEASE=yes`
  Optionally override GITHUB_REPO to 'munkireport/MunkiReport-Python'
Identifier: com.github.davidbpirie.munki.MunkiReportPython2
ParentRecipe: com.github.davidbpirie.download.MunkiReportPython2
MinimumVersion: 2.3.0

Input:
  NAME: MunkiReportPython2
  MUNKI_DISPLAYNAME: MunkiReport Python 2
  MUNKI_DESCRIPTION: Python 2 interpreter for MunkiReport.
  MUNKI_CATEGORY: Utilities
  MUNKI_DEVELOPER: MunkiReport
  MUNKI_REPO_SUBDIR: '%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%'
  pkginfo:
    catalogs:
    - testing
    category: '%MUNKI_CATEGORY%'
    description: '%MUNKI_DESCRIPTION%'
    developer: '%MUNKI_DEVELOPER%'
    display_name: '%MUNKI_DISPLAYNAME%'
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true

Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
