Description: |
  Downloads the latest version of DADman as a zip archive.

  Access to Digital Audio DK downloads is behind a login, so first create an
  account on their portal https://www.digitalaudiosupport.com/register-2/
  and then provide the username (not email) and password in your override.

Identifier: com.github.davidbpirie.download.DADman
ParentRecipe: com.github.davidbpirie.download.cookie.DigitalAudioDenmark
MinimumVersion: 2.3.0

Input:
  NAME: DADman
  SEARCH_URL_SUFFIX: download-dadman-control-software/
  SEARCH_RE: href="([^"]*)"[^>]*>[^<]*DADman for macOS Ver

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%SEARCH_RE%'
      url: '%BASE_URL%%SEARCH_URL_SUFFIX%'
      result_output_var_name: download_url
      curl_opts:
        - --cookie
        - '%RECIPE_CACHE_DIR%/cookie_jar.txt'

  - Processor: com.github.jazzace.processors/TextSearcher
    Arguments:
      re_pattern: .*/(.*)
      text_in: '%download_url%'
      result_output_var_name: filename

  - Processor: URLDownloader
    Arguments:
      url: '%download_url%'
      filename: '%NAME%.zip'

  - Processor: EndOfCheckPhase

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/downloads/ignore.txt'
        - '%RECIPE_CACHE_DIR%/cookie_jar.txt'
