Description: |
  Downloads the latest version of DADman as a zip archive, unpacks
  the pkg from the archive, verifies the signature, extracts the
  version, then copies the pkg.

  Access to Digital Audio DK downloads is behind a login, so first create an
  account on their portal https://www.digitalaudiosupport.com/register-2/
  and then provide the username (not email) and password in your override.

Identifier: com.github.davidbpirie.pkg.DADman
ParentRecipe: com.github.davidbpirie.download.DADman
MinimumVersion: 2.3.0

Input:
  NAME: DADman

Process:
  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unzip'
      purge_destination: True

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%RECIPE_CACHE_DIR%/unzip/*.pkg'
      expected_authority_names:
        - 'Developer ID Installer: NTP Technology A/S (R7RXZYFSR7)'
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/unzip/*.pkg'

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%found_filename%'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      purge_destination: True

  - Processor: FileFinder
    Arguments:
      pattern: '%RECIPE_CACHE_DIR%/unpack/*.pkg'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%found_filename%/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/Applications/DADman.app'


  - Processor: PkgCopier
    Arguments:
      source_pkg: '%RECIPE_CACHE_DIR%/unzip/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
