Description: |
  Downloads the latest version of DADman as a zip archive.

  Access to Digital Audio DK downloads is behind a login, so first create an
  account on their portal https://www.digitalaudiosupport.com/register-2/
  and then provide the username (not email) and password in your override.

Identifier: com.github.davidbpirie.download.DADman
MinimumVersion: 2.3.0

Input:
  NAME: DADman
  BASE_URL: https://www.digitalaudiosupport.com/
  LOGIN_URL_SUFFIX: login-2/
  SEARCH_URL_SUFFIX: download-dadman-control-software/
  SEARCH_RE: href="([^"]*)"[^>]*>[^<]*DADman for macOS Ver
  WEB_USERNAME: 'actgovsoedev'
  WEB_PASSWORD: 'Sasaki-violent-dion1'
  FORM_ID: '498'
  WP_NONCE: 'fc0a5a73e7'

Process:
  - Processor: StopProcessingIf
    Arguments:
      predicate: WEB_USERNAME == 'Put_Username_into_AutoPkg_recipe_override'

  - Processor: StopProcessingIf
    Arguments:
      predicate: WEB_PASSWORD == 'Put_Password_into_AutoPkg_recipe_override'

  - Processor: URLDownloader
    Arguments:
      url: '%BASE_URL%%LOGIN_URL_SUFFIX%'
      filename: 'ignore.txt'
      curl_opts:
        - --cookie-jar
        - '%RECIPE_CACHE_DIR%/cookie_jar.txt'
        - --data
        - username-%FORM_ID%=%WEB_USERNAME%&user_password-%FORM_ID%=%WEB_PASSWORD%&form_id=%FORM_ID%&_wpnonce=%WP_NONCE%

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%SEARCH_RE%'
      url: '%BASE_URL%%SEARCH_URL_SUFFIX%'
      curl_opts:
        - --cookie
        - '%RECIPE_CACHE_DIR%/cookie_jar.txt'

  - Processor: com.github.jazzace.processors/TextSearcher
    Arguments:
      re_pattern: .*/(.*)
      text_in: '%match%'
      result_output_var_name: filename

  - Processor: URLDownloader
    Arguments:
      url: '%match%'
      filename: '%NAME%.zip'

  - Processor: EndOfCheckPhase

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/downloads/ignore.txt'
        - '%RECIPE_CACHE_DIR%/cookie_jar.txt'
