Description: |
  Downloads the latest version of Shutter Encoder as a pkg,
  verifies the code signature, then finds the version and
  re-packages the app without the postinstall script.
  Set ARCH to one of:
  "Mac" for Intel
  "Apple Silicon" for ARM
Identifier: com.github.davidbpirie.pkg.ShutterEncoder
ParentRecipe: com.github.davidbpirie.download.ShutterEncoder
MinimumVersion: 2.3.0

Input:
  NAME: ShutterEncoder
  ARCH: Apple Silicon

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    flat_pkg_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'

- Processor: PkgPayloadUnpacker
  Arguments:
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/com.paulpacifico.shutterencoder.pkg/Payload'
    destination_path: '%RECIPE_CACHE_DIR%/payload'
    purge_destination: True

- Processor: AppPkgCreator
  Arguments:
    app_path: '%RECIPE_CACHE_DIR%/payload/Shutter Encoder.app'
    pkg_path: '%RECIPE_CACHE_DIR%/Shutter Encoder %ARCH%-%version%.pkg'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
    - '%RECIPE_CACHE_DIR%/payload'

