Description: |
  Downloads the latest Excel 2019 update pkg, and appends the version
  to the end of the filename, then uploads the package to Jamf Pro,
  creating the Category if required.

  JSS_URL, API_USERNAME, and API_PASSWORD, and for non-cloud instances
  SMB_URL, SMB_USERNAME and SMB_PASSWORD, are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.
Identifier: com.github.davidbpirie.jamf-upload.MSExcel2019
MinimumVersion: "2.3"
ParentRecipe: com.github.autopkg.download.MSExcel2019

Input:
  NAME: MSExcel2019
  JAMF_CATEGORY: Productivity
  JAMF_CATEGORY_PRIORITY: "10"
  JAMF_REPLACE_CATEGORY: "False"
  JAMF_PKG_NAME: "%NAME%"
  JAMF_PKG_INFO: "Create, view, edit, and share your spreadsheets using Excel for Mac. Now it's easier than ever to work with spreadsheets across your devices and with others. Share your files and collaborate in real time within a document or edit Office docs attached to emails. Get smart assistance features as soon as they are released in Word, Excel, and PowerPoint so you're always working with the latest. Whether you're balancing a budget, tracking milestones or looking to visualise any data, Excel is your go-to app for working with spreadsheets."
  JAMF_PKG_NOTES: "Generated and uploaded by AutoPkg"
  JAMF_PKG_PRIORITY: "10"
  JAMF_REBOOT_REQUIRED: "False"
  JAMF_OS_REQUIREMENTS: ""
  JAMF_REQUIRED_PROCESSOR: None
  JAMF_SEND_NOTIFICATION: "False"
  JAMF_REPLACE_PKG: "False"
  JAMF_REPLACE_PKG_METADATA: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%JAMF_CATEGORY%"
      category_priority: "%JAMF_CATEGORY_PRIORITY%"
      replace_category: "%JAMF_REPLACE_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_name: "%JAMF_PKG_NAME%-%version%.pkg"
      pkg_category: "%JAMF_CATEGORY%"
      pkg_info: "%JAMF_PKG_INFO%"
      pkg_notes: "%JAMF_PKG_NOTES%"
      pkg_priority: "%JAMF_PKG_PRIORITY%"
      reboot_required: "%JAMF_REBOOT_REQUIRED%"
      os_requirements: "%JAMF_OS_REQUIREMENTS%"
      required_processor: "%JAMF_REQUIRED_PROCESSOR%"
      send_notification: "%JAMF_SEND_NOTIFICATION%"
      replace_pkg: "%JAMF_REPLACE_PKG%"
