Description: |
  Downloads the latest Microsoft Teams pkg, and appends the version
  to the end of the filename, then uploads the package to Jamf Pro,
  creating the Category if required, and then creates a Self Service
  Policy and Smart Group.

  JSS_URL, API_USERNAME, and API_PASSWORD, and for non-cloud instances
  SMB_URL, SMB_USERNAME and SMB_PASSWORD, are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.

  Template files for JAMF_GROUP_TEMPLATE and JAMF_POLICY_TEMPLATE need
  to either be found in your recipe search path or provide a full path.
  Examples are available from
  https://github.com/autopkg/davidbpirie-recipes/tree/main/JamfTemplates
  or https://github.com/autopkg/grahampugh-recipes/tree/main/Jamf_Recipes.
  It is recommended to store them in your RecipeOverrides directory and
  can be shared across multiple recipe overrides.

  JAMF_POLICY_ICON must also either be in your recipe search path or
  provide a full path. It is recommended to store it in your
  RecipeOverrides directory.
Identifier: com.github.davidbpirie.jamf.MSTeams
MinimumVersion: "2.3"
ParentRecipe: com.github.davidbpirie.jamf-upload.MSTeams

Input:
  NAME: MSTeams
  JAMF_APPLICATION_NAME: "Microsoft Teams"
  JAMF_SELF_SERVICE_DESCRIPTION: "Microsoft Teams is a proprietary business communication platform developed by Microsoft, as part of the Microsoft 365 family of products. Teams offers workspace chat and videoconferencing, file storage, and application integration."
  JAMF_UPDATE_PREDICATE: "pkg_uploaded == False"
  JAMF_GROUP_NAME: "%NAME%-update-smart"
  JAMF_GROUP_TEMPLATE: "%RECIPE_DIR%/../JamfTemplates/JamfSmartGroupTemplate.xml"
  JAMF_REPLACE_GROUP: "False"
  JAMF_POLICY_NAME: "Install Latest %JAMF_APPLICATION_NAME%"
  JAMF_POLICY_ICON: "%NAME%.png"
  JAMF_POLICY_TEMPLATE: "%RECIPE_DIR%/../JamfTemplates/JamfPolicyTemplate.xml"
  JAMF_REPLACE_POLICY: "False"
  JAMF_REPLACE_ICON: "False"

Process:
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%JAMF_UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_name: "%JAMF_GROUP_NAME%-%version%"
      computergroup_template: "%JAMF_GROUP_TEMPLATE%"
      replace_group: "%JAMF_REPLACE_GROUP%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_name: "%JAMF_POLICY_NAME%-%version%"
      icon: "%JAMF_POLICY_ICON%"
      policy_template: "%JAMF_POLICY_TEMPLATE%"
      replace_policy: "%JAMF_REPLACE_POLICY%"
      replace_icon: "%JAMF_REPLACE_ICON%"
