Description: |
  Downloads the latest version of Livestream Studio pkg, verifies the
  signature, and extracts the version.
Identifier: com.github.davidbpirie.download.LivestreamStudio
MinimumVersion: 2.3.0

Input:
  NAME: LivestreamStudio
  DOWNLOAD_URL: https://livestreamstudio.net/macosx/LivestreamStudio.pkg

Process:
  - Processor: URLDownloader
    Arguments:
      filename: '%NAME%.pkg'
      url: '%DOWNLOAD_URL%'

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%'
      expected_authority_names:
        - 'Developer ID Installer: Vimeo.com, Inc. (35R365FS4Q)'
        - Developer ID Certification Authority
        - Apple Root CA

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pathname%'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      purge_destination: True

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload/Livestream Studio.app'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/Livestream Studio.app'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
