Description: |
  Downloads the latest version of Wireshark, copies the Install
  ChmodBPF pkg from the downloaded dmg, then uploads the package
  to Jamf Pro.

  ARCH should be one of Intel or Arm, but should not affect the result.

  JSS_URL, API_USERNAME, and API_PASSWORD, and for non-cloud instances
  SMB_URL, SMB_USERNAME and SMB_PASSWORD, are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.
Identifier: com.github.davidbpirie.jamf-upload.wiresharkchmodbpf
MinimumVersion: 2.3.0
ParentRecipe: com.github.davidbpirie.pkg.wiresharkchmodbpf

Input:
  NAME: WiresharkChmodBPF
  JAMF_CATEGORY: Utilities
  JAMF_PKG_NAME: '%NAME%'
  JAMF_PKG_INFO: Adjusts permissions on the packet capture devices (/dev/bpf*) when the system starts up, granting access to the access_bpf group.
  JAMF_PKG_NOTES: 'Generated and uploaded by AutoPkg'
  JAMF_PKG_PRIORITY: '10'
  JAMF_PKG_REBOOT_REQUIRED: 'False'
  JAMF_PKG_OS_REQUIREMENTS: ''
  JAMF_PKG_REQUIRED_PROCESSOR: None
  JAMF_PKG_SEND_NOTIFICATION: 'False'
  JAMF_PKG_REPLACE: 'False'
  JAMF_PKG_REPLACE_METADATA: 'False'
  JAMF_PKG_SUFFIX: 'pkg'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_name: '%JAMF_PKG_NAME%-%version%.%JAMF_PKG_SUFFIX%'
      pkg_category: '%JAMF_CATEGORY%'
      pkg_info: '%JAMF_PKG_INFO%'
      pkg_notes: '%JAMF_PKG_NOTES%'
      pkg_priority: '%JAMF_PKG_PRIORITY%'
      reboot_required: '%JAMF_PKG_REBOOT_REQUIRED%'
      os_requirements: '%JAMF_PKG_OS_REQUIREMENTS%'
      required_processor: '%JAMF_PKG_REQUIRED_PROCESSOR%'
      send_notification: '%JAMF_PKG_SEND_NOTIFICATION%'
      replace_pkg: '%JAMF_PKG_REPLACE%'
      replace_pkg_metadata: '%JAMF_PKG_REPLACE_METADATA%'

  - Processor: PathDeleter
    Arguments:
      path_list:
      - '%pkg_path%'
