Description: |
  Generic Jamf upload recipe to be used with overrides for repeated manual creation
  of multiple versions of an item to be installed in an outset directory.
  The resulting package includes a postinstall script that sets an outset
  override for the installed item, forcing it to be re-run on next trigger.
  Intended use is to generate an override from this recipe, then give the
  override an unique Identifier and populate all the Input variables.

  OUTSET_ITEM_TYPE is the name of the outset folder the item should be
  installed in i.e. one of:
    login-once
    login-privileged-once

  When using the recipe, also provide the source via the -p parameter and version via the -k parameter eg:
  autopkg run myoutsetitem.jamf-upload -p myscript.sh -k version=1.0
Identifier: com.github.davidbpirie.jamf-upload.genericoutsetitemwithoverride
ParentRecipe: com.github.davidbpirie.pkg.genericoutsetitemwithoverride
MinimumVersion: 2.3.0

Input:
  NAME: GenericOutsetItemWithOverride
  OUTSET_ITEM_TYPE: Put_Item_Type_into_AutoPkg_recipe_override
  JAMF_CATEGORY: Utilities
  JAMF_CATEGORY_PRIORITY: '10'
  JAMF_CATEGORY_REPLACE: 'False'
  JAMF_PKG_INFO: ''
  JAMF_PKG_NAME: 'Outset %OUTSET_ITEM_TYPE% %NAME%'
  JAMF_PKG_NOTES: 'Generated and uploaded by AutoPkg'
  JAMF_PKG_OS_REQUIREMENTS: ''
  JAMF_PKG_PRIORITY: '10'
  JAMF_PKG_REBOOT_REQUIRED: 'False'
  JAMF_PKG_REPLACE: 'False'
  JAMF_PKG_REPLACE_METADATA: 'False'
  JAMF_PKG_REQUIRED_PROCESSOR: None
  JAMF_PKG_SEND_NOTIFICATION: 'False'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: '%JAMF_CATEGORY%'
      category_priority: '%JAMF_CATEGORY_PRIORITY%'
      replace_category: '%JAMF_CATEGORY_REPLACE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_name: '%JAMF_PKG_NAME%-%version%.pkg'
      pkg_category: '%JAMF_CATEGORY%'
      pkg_info: '%JAMF_PKG_INFO%'
      pkg_notes: '%JAMF_PKG_NOTES%'
      pkg_priority: '%JAMF_PKG_PRIORITY%'
      reboot_required: '%JAMF_PKG_REBOOT_REQUIRED%'
      os_requirements: '%JAMF_PKG_OS_REQUIREMENTS%'
      required_processor: '%JAMF_PKG_REQUIRED_PROCESSOR%'
      send_notification: '%JAMF_PKG_SEND_NOTIFICATION%'
      replace_pkg: '%JAMF_PKG_REPLACE%'
      replace_pkg_metadata: '%JAMF_PKG_REPLACE_METADATA%'
