<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Generic munki import recipe to be used with overrides for manual import of a payload-free package that adds a specific item to the Dock.
			Intended use is to generate an override from this recipe, then give the override an unique Identifier and populate all the Input variables.
		</string>
		<key>Identifier</key>
		<string>com.github.davidbpirie.munki.genericdockitem</string>
		<key>MinimumVersion</key>
		<string>2.0.0</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>GenericDockItem</string>
			<key>PKG_ID</key>
			<string>com.github.davidbpirie.pkg.GenericDockItem</string>
			<key>VERSION</key>
			<string>0.0</string>
			<key>DOCKUTIL_ITEM</key>
			<string>/Applications/Generic App.app</string>
			<key>DOCKUTIL_LABEL</key>
			<string>Generic App</string>
			<key>DOCKUTIL_FOLDEROPTIONS</key>
			<string></string>
			<key>DOCKUTIL_POSITIONOPTONS</key>
			<string>--section apps</string>
			<key>DOCKUTIL_REPLACING</key>
			<string>%DOCKUTIL_LABEL%</string>
			<key>USER_TEMPLATE_PATH</key>
			<string>/Library/User Template/Non_localized</string>
			<key>MUNKI_DISPLAYNAME</key>
			<string>Generic Dock Item</string>
			<key>MUNKI_DESCRIPTION</key>
			<string>Generic Dock Item</string>
			<key>MUNKI_CATEGORY</key>
			<string>Utilities</string>
			<key>MUNKI_DEVELOPER</key>
			<string>Generic</string>
			<key>MUNKI_UPDATE_FOR</key>
			<string>Generic App</string>
			<key>MUNKI_MINIMUM_OS_VERSION</key>
			<string>10.15.0</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>%MUNKI_DESCRIPTION%</string>
				<key>developer</key>
				<string>%MUNKI_DEVELOPER%</string>
				<key>display_name</key>
				<string>%MUNKI_DISPLAYNAME%</string>
				<key>minimum_os_version</key>
				<string>%MUNKI_MINIMUM_OS_VERSION%</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>requires</key>
				<array>
					<string>dockutil</string>
				</array>
				<key>update_for</key>
				<array>
					<string>%MUNKI_UPDATE_FOR%</string>
				</array>
				<key>unattended_install</key>
				<false />
				<key>autoremove</key>
				<true />
				<key>RestartAction</key>
				<string>RequireLogout</string>
			</dict>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>pkgdirs</key>
					<dict>
						<key>payload</key>
						<string>0775</string>
						<key>scripts</key>
						<string>0775</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
					<key>file_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/scripts/postinstall</string>
					<key>file_mode</key>
					<string>0777</string>
					<key>file_content</key>
					<string>#!/bin/sh
	
INSTALLATION_PACKAGE=&quot;$1&quot;
INSTALLATION_DESTINATION=&quot;$2&quot;
INSTALLATION_VOLUME=&quot;$3&quot;
INSTALLATION_SYSTEM_ROOT=&quot;$4&quot;

USERTEMPLATEDOCK=&quot;${INSTALLATION_VOLUME}%USER_TEMPLATE_PATH%/Library/Preferences/com.apple.dock.plist&quot;

/usr/bin/touch &quot;${USERTEMPLATEDOCK}&quot;
/usr/local/bin/dockutil --add &quot;%DOCKUTIL_ITEM%&quot; --label &quot;%DOCKUTIL_LABEL%&quot; %DOCKUTIL_FOLDEROPTIONS% --replacing &quot;%DOCKUTIL_REPLACING%&quot; %DOCKUTIL_POSITIONOPTONS% --no-restart &quot;${USERTEMPLATEDOCK}&quot; || /usr/bin/true
/usr/local/bin/dockutil --add &quot;%DOCKUTIL_ITEM%&quot; --label &quot;%DOCKUTIL_LABEL%&quot; %DOCKUTIL_FOLDEROPTIONS% --replacing &quot;%DOCKUTIL_REPLACING%&quot; %DOCKUTIL_POSITIONOPTONS% --allhomes || /usr/bin/true
</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
					<key>file_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/uninstall</string>
					<key>file_mode</key>
					<string>0777</string>
					<key>file_content</key>
					<string>#!/bin/sh

USERTEMPLATEDOCK=&quot;%USER_TEMPLATE_PATH%/Library/Preferences/com.apple.dock.plist&quot;

/usr/local/bin/dockutil --remove &quot;%DOCKUTIL_LABEL%&quot; --no-restart &quot;${USERTEMPLATEDOCK}&quot;
/usr/local/bin/dockutil --remove &quot;%DOCKUTIL_LABEL%&quot; --allhomes
</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>pkgroot</key>
						<string>%RECIPE_CACHE_DIR%/%NAME%/payload</string>
						<key>scripts</key>
						<string>%RECIPE_CACHE_DIR%/%NAME%/scripts</string>
						<key>pkgname</key>
						<string>%NAME%-%VERSION%</string>
						<key>id</key>
						<string>%PKG_ID%</string>
						<key>version</key>
						<string>%VERSION%</string>
						<key>options</key>
						<string>purge_ds_store</string>
						<key>chown</key>
						<array></array>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
					<key>additional_makepkginfo_options</key>
					<array>
						<string>--uninstall_script=%RECIPE_CACHE_DIR%/%NAME%/uninstall</string>
					</array>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>