Description: |
  Generic munki import recipe to be used with overrides for manual import of a
  payload-free package that adds a specific item to the Dock.
  Intended use is to generate an override from this recipe, then give the
  override an unique Identifier and populate all the Input variables.
Identifier: com.github.davidbpirie.munki.genericdockitem
ParentRecipe: com.github.davidbpirie.pkg.genericdockitem
MinimumVersion: 2.3.0

Input:
  NAME: GenericDockItem
  PKG_ID: com.github.davidbpirie.pkg.GenericDockItem
  VERSION: '0.0'
  DOCKUTIL_ITEM: /Applications/Generic App.app
  DOCKUTIL_LABEL: Generic App
  DOCKUTIL_FOLDEROPTIONS: ''
  DOCKUTIL_POSITIONOPTONS: --section apps
  DOCKUTIL_REPLACING: '%DOCKUTIL_LABEL%'
  USER_TEMPLATE_PATH: /Library/User Template/Non_localized
  MUNKI_DISPLAYNAME: Generic Dock Item
  MUNKI_DESCRIPTION: Generic Dock Item
  MUNKI_CATEGORY: Utilities
  MUNKI_DEVELOPER: Generic
  MUNKI_UPDATE_FOR: Generic App
  MUNKI_MINIMUM_OS_VERSION: 10.15.0
  MUNKI_REPO_SUBDIR: '%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%'
  pkginfo:
    RestartAction: RequireLogout
    autoremove: true
    catalogs:
    - testing
    category: '%MUNKI_CATEGORY%'
    description: '%MUNKI_DESCRIPTION%'
    developer: '%MUNKI_DEVELOPER%'
    display_name: '%MUNKI_DISPLAYNAME%'
    minimum_os_version: '%MUNKI_MINIMUM_OS_VERSION%'
    name: '%NAME%'
    requires:
    - dockutil
    unattended_install: false
    update_for:
    - '%MUNKI_UPDATE_FOR%'

Process:
- Processor: MunkiImporter
  Arguments:
    additional_makepkginfo_options:
    - --uninstall_script=%RECIPE_CACHE_DIR%/%NAME%/uninstall
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/%NAME%'
