Description: |
  Generic jamf recipe to be used with overrides for repeated
  manual upload of a dock item, and then creating a policy from
  the provided template.

  Intended use is to generate an override from this recipe, then
  give the override an unique Identifier, rename it, and populate
  all the Input variables.

  JSS_URL, API_USERNAME, and API_PASSWORD are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.

Identifier: com.github.davidbpirie.jamf.genericdockitem
ParentRecipe: com.github.davidbpirie.jamf-upload.genericdockitem
MinimumVersion: 2.3.0

Input:
  NAME: GenericDockItem
  JAMF_CATEGORY: Policies
  JAMF_DOCKITEM_NAME: '%NAME%'
  JAMF_DOCKITEM_TYPE: 'App'
  JAMF_DOCKITEM_PATH: 'file:///Applications/%NAME%.app/'
  JAMF_DOCKITEM_REPLACE: 'False'
  JAMF_POLICY_ICON: '%NAME%.png'
  JAMF_POLICY_NAME: '%NAME%'
  JAMF_POLICY_TEMPLATE: 'Put_Policy_Template_into_AutoPkg_recipe_override'
  JAMF_REPLACE_ICON: 'false'
  JAMF_REPLACE_POLICY: 'true'

Process:
  - Processor: StopProcessingIf
    Arguments:
      predicate: JAMF_POLICY_TEMPLATE == 'Put_Policy_Template_into_AutoPkg_recipe_override'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_name: '%JAMF_POLICY_NAME%'
      icon: '%JAMF_POLICY_ICON%'
      policy_template: '%JAMF_POLICY_TEMPLATE%'
      replace_policy: '%JAMF_REPLACE_POLICY%'
      replace_icon: '%JAMF_REPLACE_ICON%'
