Description: |
  Generic pkg recipe to be used with overrides for repeated manual creation
  of multiple versions of an item to be installed in an outset directory.
  Intended use is to generate an override from this recipe, then give the
  override an unique Identifier and populate all the Input variables.

  OUTSET_ITEM_TYPE is the name of the outset folder the item should be
  installed in i.e. one of:
    boot-every
    boot-once
    login-every
    login-once
    login-privileged-every
    login-privileged-once
    on-demand

  Uses StringReplacer processor from com.github.grahampugh.recipes.commonprocessors.

  When using the recipe, also provide the source via the -p parameter and version via the -k parameter eg:
  autopkg run myoutsetitem.pkg -p myscript.sh -k version=1.0
Identifier: com.github.davidbpirie.pkg.genericoutsetitem
MinimumVersion: 2.3.0

Input:
  NAME: GenericOutsetItem
  OUTSET_ITEM_TYPE: Put_Item_Type_into_AutoPkg_recipe_override
  PKG_ID: com.github.davidbpirie.pkg.outset-%OUTSET_ITEM_TYPE%.%NAME%
  version: Provide_version_in_input_key

Process:
- Processor: PackageRequired

- Processor: StopProcessingIf
  Arguments:
    predicate: OUTSET_ITEM_TYPE != 'boot-every' AND OUTSET_ITEM_TYPE != 'boot-once' AND OUTSET_ITEM_TYPE != 'login-every' AND OUTSET_ITEM_TYPE != 'login-once' AND OUTSET_ITEM_TYPE != 'login-privileged-every' AND OUTSET_ITEM_TYPE != 'login-privileged-once' AND OUTSET_ITEM_TYPE != 'on-demand'

- Processor: StopProcessingIf
  Arguments:
    predicate: version == 'Provide_version_in_input_key'

- Processor: StopProcessingIf
  Arguments:
    predicate: OUTSET_ITEM_TYPE == 'Put_Item_Type_into_AutoPkg_recipe_override'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      payload: '0775'
      payload/usr: '0755'
      payload/usr/local: '0755'
      payload/usr/local/outset: '0755'
      payload/usr/local/outset/action_type: '0755'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: FileMover
  Arguments:
    source: '%RECIPE_CACHE_DIR%/%NAME%/payload/usr/local/outset/action_type'
    target: '%RECIPE_CACHE_DIR%/%NAME%/payload/usr/local/outset/%OUTSET_ITEM_TYPE%'

- Processor: PkgCopier
  Arguments:
    source_pkg: '%PKG%'

- Processor: com.github.grahampugh.recipes.commonprocessors/StringReplacer
  Arguments:
    input_string: '%pkg_path%'
    string_to_replace: '%RECIPE_CACHE_DIR%/'
    replacement_string: ''

- Processor: FileMover
  Arguments:
    source: '%pkg_path%'
    target: '%RECIPE_CACHE_DIR%/%NAME%/payload/usr/local/outset/%OUTSET_ITEM_TYPE%/%output_string%'

- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: wheel
        mode: '0755'
        path: usr
        user: root
      id: '%PKG_ID%'
      options: purge_ds_store
      pkgname: '%NAME%-%version%'
      pkgroot: '%RECIPE_CACHE_DIR%/%NAME%/payload'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/%NAME%'
