Description: |
  Generic munki import recipe to be used with overrides for repeated manual
  import of multiple versions of a script as a payload-free package.
  Intended use is to generate an override from this recipe, then give the
  override an unique Identifier and populate all the Input variables.
  When using the recipe, also provide the source via the -p parameter and version via the -k parameter eg:
  autopkg run myscript.munki -p myscript.sh -k VERSION=1.0
Identifier: com.github.davidbpirie.munki.genericpayloadfree
ParentRecipe: com.github.davidbpirie.pkg.genericpayloadfree
MinimumVersion: 2.3.0

Input:
  NAME: GenericPayloadFree
  VERSION: '0.0'
  MUNKI_DISPLAYNAME: Generic Payload Free
  MUNKI_DESCRIPTION: Generic Payload Free
  MUNKI_CATEGORY: Utilities
  MUNKI_DEVELOPER: Generic
  MUNKI_MINIMUM_OS_VERSION: 10.6.0
  MUNKI_REPO_SUBDIR: '%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%'
  pkginfo:
    catalogs:
    - testing
    category: '%MUNKI_CATEGORY%'
    description: '%MUNKI_DESCRIPTION%'
    developer: '%MUNKI_DEVELOPER%'
    display_name: '%MUNKI_DISPLAYNAME%'
    minimum_os_version: '%MUNKI_MINIMUM_OS_VERSION%'
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: MunkiImporter
  Arguments:
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
