<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Generic munki import recipe to be used with overrides for repeated manual import of multiple versions of the same package.
			Intended use is to generate an override from this recipe, then give the override an unique Identifier and populate all the Input
			variables. When using the recipe, also set the PKG via -k/--key parameter eg:
			autopkg run myapp.munki -k PKG=myapp.dmg
		</string>
		<key>Identifier</key>
		<string>com.github.davidbpirie.munki.generic</string>
		<key>MinimumVersion</key>
		<string>2.0.0</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Generic</string>
			<key>MUNKI_DISPLAYNAME</key>
			<string>Generic</string>
			<key>MUNKI_DESCRIPTION</key>
			<string>Generic</string>
			<key>MUNKI_CATEGORY</key>
			<string>Business</string>
			<key>MUNKI_DEVELOPER</key>
			<string>Generic</string>
			<key>MUNKI_MINIMUM_OS_VERSION</key>
			<string>10.6.0</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%</string>
			<key>pkginfo</key>
			<dict>
				<key>blocking_applications</key>
				<array>
					<string>Generic.app</string>
				</array>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>%MUNKI_DESCRIPTION%</string>
				<key>developer</key>
				<string>%MUNKI_DEVELOPER%</string>
				<key>display_name</key>
				<string>%MUNKI_DISPLAYNAME%</string>
				<key>minimum_os_version</key>
				<string>%MUNKI_MINIMUM_OS_VERSION%</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true />
			</dict>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>PackageRequired</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%PKG%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>