Description: |
  Generic jamf recipe to be used with overrides for repeated manual upload
  of a Computer Profile from a .mobileconfig file.

  Intended use is to generate an override from this recipe, then
  give the override an unique Identifier, rename it, and populate
  all the Input variables.

  Template file for JAMF_COMPUTERPROFILE_TEMPLATE need to either be found
  in your recipe search path or provide a full path.
  Examples are available from
  https://github.com/autopkg/grahampugh-recipes/tree/main/_Templates_Examples.

  JSS_URL, API_USERNAME, and API_PASSWORD are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.
Identifier: com.github.davidbpirie.jamf.genericcomputerprofile
MinimumVersion: 2.3.0

Input:
  NAME: GenericPayloadComputerProfile
  JAMF_CATEGORY: Configuration
  JAMF_COMPUTERPROFILE_MOBILECONFIG: ''
  JAMF_COMPUTERPROFILE_TEMPLATE: JamfComputerProfileTemplate.xml
  JAMF_COMPUTERPROFILE_UNSIGN: 'True'
  JAMF_COMPUTERPROFILE_REPLACE: 'False'

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
  Arguments:
    mobileconfig: '%JAMF_COMPUTERPROFILE_MOBILECONFIG%'
    profile_template: '%JAMF_COMPUTERPROFILE_TEMPLATE%'
    profile_category: '%JAMF_CATEGORY%'
    unsign_profile: '%JAMF_COMPUTERPROFILE_UNSIGN%'
    replace_profile: '%JAMF_COMPUTERPROFILE_REPLACE%'
