Description: |
  Generic pkg recipe to be used with overrides for repeated manual creation
  of multiple versions of a script as a signed payload-free distribution-style package.
  Uses ModeChanger processor from com.github.jessepeterson.munki.UniversalTypeClient5.
  Intended use is to generate an override from this recipe, then give the
  override an unique Identifier and populate all the Input variables.
  When using the recipe, also provide the source via the -p parameter and version via the -k parameter eg:
  autopkg run myscript.pkg -p myscript.sh -k VERSION=1.0
Identifier: com.github.davidbpirie.sign.genericpayloadfreedist
ParentRecipe: com.github.davidbpirie.pkg.genericpayloadfreedist
MinimumVersion: 2.3.0

Input:
  NAME: GenericPayloadFreeFlat
  SIGNINGCERTIFICATE: Put_Signing_Certificate_into_AutoPkg_recipe_override

Process:
  - Processor: StopProcessingIf
    Arguments:
      predicate: SIGNINGCERTIFICATE == "Put_Signing_Certificate_into_AutoPkg_recipe_override"

  - Processor: com.github.rtrouton.SharedProcessors/PkgSigner
    Arguments:
      signing_cert: "%SIGNINGCERTIFICATE%"
