Description: |
  Generic jamf recipe to be used with overrides for repeated
  manual upload of a policy from the provided template, creating
  the Category if required.

  Intended use is to generate an override from this recipe, then
  give the override an unique Identifier, rename it, and populate
  all the Input variables.

  JSS_URL, API_USERNAME, and API_PASSWORD, and for non-cloud instances
  SMB_URL, SMB_USERNAME and SMB_PASSWORD, are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.

  Template file for JAMF_POLICY_TEMPLATE need to either be found in your
  recipe search path or provide a full path. Examples are available from
  https://github.com/autopkg/grahampugh-recipes/tree/main/Jamf_Recipes.
  It is recommended to store it in your RecipeOverrides directory and
  can be shared across multiple recipe overrides.

Identifier: com.github.davidbpirie.jamf.genericpolicy
MinimumVersion: 2.3.0

Input:
  NAME: GenericPolicy
  JAMF_CATEGORY: Policies
  JAMF_CATEGORY_PRIORITY: '10'
  JAMF_CATEGORY_REPLACE: 'False'
  JAMF_POLICY_ICON: '%NAME%.png'
  JAMF_POLICY_NAME: '%NAME%'
  JAMF_POLICY_TEMPLATE: 'Put_Policy_Template_into_AutoPkg_recipe_override'
  JAMF_REPLACE_ICON: 'false'
  JAMF_REPLACE_POLICY: 'true'

Process:
  - Processor: StopProcessingIf
    Arguments:
      predicate: JAMF_POLICY_TEMPLATE == "Put_Policy_Template_into_AutoPkg_recipe_override"

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%JAMF_CATEGORY%'
    category_priority: '%JAMF_CATEGORY_PRIORITY%'
    replace_category: '%JAMF_CATEGORY_REPLACE%'

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_name: '%JAMF_POLICY_NAME%'
      icon: '%JAMF_POLICY_ICON%'
      policy_template: '%JAMF_POLICY_TEMPLATE%'
      replace_policy: '%JAMF_REPLACE_POLICY%'
      replace_icon: '%JAMF_REPLACE_ICON%'
