Description: |
  Generic jamf-upload recipe to be used with overrides for repeated
  manual upload of a Computer Profile from a Payload XML file.

  Intended use is to generate an override from this recipe, then
  give the override an unique Identifier, rename it, and populate
  all the Input variables.

  Template file for JAMF_COMPUTERGROUP_TEMPLATE need to either be found
  in your recipe search path or provide a full path.
  Examples are available from
  https://github.com/autopkg/grahampugh-recipes/tree/main/_Templates_Examples.

  JSS_URL, API_USERNAME, and API_PASSWORD are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.
Identifier: com.github.davidbpirie.jamf-upload.genericpayloadcomputerprofile
MinimumVersion: 2.3.0

Input:
  NAME: GenericPayloadComputerProfile
  JAMF_CATEGORY: Configuration
  JAMF_CATEGORY_PRIORITY: '10'
  JAMF_CATEGORY_REPLACE: 'False'
  JAMF_COMPUTERPROFILE_NAME: '%NAME%'
  JAMF_COMPUTERPROFILE_PAYLOAD: ''
  JAMF_COMPUTERPROFILE_IDENTIFIER: ''
  JAMF_COMPUTERPROFILE_TEMPLATE: JamfComputerProfileTemplate.xml
  JAMF_COMPUTERPROFILE_ORGANIZATION: ''
  JAMF_COMPUTERPROFILE_DESCRIPTION: ''
  JAMF_COMPUTERPROFILE_REPLACE: 'False'

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%JAMF_CATEGORY%'
    category_priority: '%JAMF_CATEGORY_PRIORITY%'
    replace_category: '%JAMF_CATEGORY_REPLACE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerProfileUploader
  Arguments:
    profile_name: '%JAMF_COMPUTERPROFILE_NAME%'
    payload: '%JAMF_COMPUTERPROFILE_PAYLOAD%'
    identifier: '%JAMF_COMPUTERPROFILE_IDENTIFIER%'
    profile_template: '%JAMF_COMPUTERPROFILE_TEMPLATE%'
    profile_category: '%JAMF_CATEGORY%'
    organization: '%JAMF_COMPUTERPROFILE_ORGANIZATION%'
    profile_description: '%JAMF_COMPUTERPROFILE_DESCRIPTION%'
    replace_profile: '%JAMF_COMPUTERPROFILE_REPLACE%'
