<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Generic munki import recipe to be used with overrides for repeated manual import of multiple versions of a script as a payload-free package.
			Intended use is to generate an override from this recipe, then give the override an unique Identifier and populate all the Input
			variables. When using the recipe, also provide the source via the -p parameter and version via the -k parameter eg:
			autopkg run myscript.munki -p myscript.sh -k VERSION=1.0
		</string>
		<key>Identifier</key>
		<string>com.github.davidbpirie.munki.genericpayloadfree</string>
		<key>MinimumVersion</key>
		<string>2.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.davidbpirie.pkg.genericpayloadfree</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>GenericPayloadFree</string>
			<key>VERSION</key>
			<string>0.0</string>
			<key>MUNKI_DISPLAYNAME</key>
			<string>Generic Payload Free</string>
			<key>MUNKI_DESCRIPTION</key>
			<string>Generic Payload Free</string>
			<key>MUNKI_CATEGORY</key>
			<string>Utilities</string>
			<key>MUNKI_DEVELOPER</key>
			<string>Generic</string>
			<key>MUNKI_MINIMUM_OS_VERSION</key>
			<string>10.6.0</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>%MUNKI_DESCRIPTION%</string>
				<key>developer</key>
				<string>%MUNKI_DEVELOPER%</string>
				<key>display_name</key>
				<string>%MUNKI_DISPLAYNAME%</string>
				<key>minimum_os_version</key>
				<string>%MUNKI_MINIMUM_OS_VERSION%</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true />
			</dict>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>