Description: |
  Generic pkg recipe to be used with overrides for repeated manual creation
  of multiple versions of a script as a payload-free distribution-style package.
  Uses ModeChanger processor from com.github.jessepeterson.munki.UniversalTypeClient5.
  Intended use is to generate an override from this recipe, then give the
  override an unique Identifier and populate all the Input variables.
  When using the recipe, also provide the source via the -p parameter and version via the -k parameter eg:
  autopkg run myscript.pkg -p myscript.sh -k VERSION=1.0
Identifier: com.github.davidbpirie.pkg.genericpayloadfreedist
ParentRecipe: com.github.davidbpirie.pkg.genericpayloadfree
MinimumVersion: 2.3.0

Input:
  NAME: GenericPayloadFreeFlat
  PKG_ID: com.github.davidbpirie.pkg.GenericPayloadFreeDist
  VERSION: '0.0'

Process:
  - Processor: com.github.davidbpirie.SharedProcessors/FlatToDistPkg
