Description: |
  Downloads the latest version of Youlean Loudness Meter 2.

Identifier: com.github.davidbpirie.download.YouleanLoudnessMeter2
MinimumVersion: 2.3.0

Input:
  NAME: YouleanLoudnessMeter2
  SEARCH_RE: <a [^>]*href="([^"]*)"[^>]*>Download for macOS</a>
  SEARCH_URL: https://youlean.co/download-youlean-loudness-meter

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: Consider switching to the Youlean Loudness Meter 2 download recipe in the dataJAR-recipes repo. This recipe is deprecated and will be removed in the future.

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%SEARCH_RE%'
      url: '%SEARCH_URL%'
      result_output_var_name: download_url

  - Processor: URLDownloader
    Arguments:
      url: '%download_url%'

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: '%pathname%/*.pkg'
      expected_authority_names:
        - 'Developer ID Installer: Julijan Nikolic (S7KN6P3F95)'
        - Developer ID Certification Authority
        - Apple Root CA
