Description: |
  Downloads the latest release of Youlean Loudness Meter 2, expands
  the archive, extracts the version and verifies the signature,
  then copies the pkg.

Identifier: com.github.davidbpirie.pkg.YouleanLoudnessMeter2
ParentRecipe: com.github.dataJAR-recipes.download.Youlean Loudness Meter 2
MinimumVersion: 2.3.0

Input:
  NAME: YouleanLoudnessMeter2

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: '%pathname%/*.pkg'
      destination_path: '%RECIPE_CACHE_DIR%/unpack'

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Application.pkg/Payload'
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      purge_destination: True

  - Processor: PlistReader
    Arguments:
      info_path: '%RECIPE_CACHE_DIR%/payload/Applications/Youlean Loudness Meter 2.app/Contents/Info.plist'

  - Processor: PkgCopier
    Arguments:
      source_pkg: '%pathname%/*.pkg'
      pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/unpack'
        - '%RECIPE_CACHE_DIR%/payload'
