Description: |
  Downloads the latest version of Youlean Loudness Monitor 2.

Identifier: com.github.davidbpirie.download.YouleanLoudnessMeter2
MinimumVersion: 2.3.0

Input:
  NAME: YouleanLoudnessMeter2
  SEARCH_RE: <a [^>]*href="([^"]*)"[^>]*>Download for macOS</a>
  SEARCH_URL: https://youlean.co/download-youlean-loudness-meter  

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: '%SEARCH_RE%'
      url: '%SEARCH_URL%'
      result_output_var_name: download_url

  - Processor: URLDownloader
    Arguments:
      url: '%download_url%'

  - Processor: EndOfCheckPhase
