Description: |
  Downloads the latest version of Auralia 7 Cloud as a pkg,
  verifies the code signature, then finds the version.
Identifier: com.github.davidbpirie.pkg.Auralia7Cloud
ParentRecipe: com.github.davidbpirie.download.Auralia7Cloud
MinimumVersion: 2.3.0

Input:
  NAME: Auralia7Cloud

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    flat_pkg_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'

- Processor: PkgPayloadUnpacker
  Arguments:
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Auralia_7_Cloud.pkg/Payload'
    destination_path: '%RECIPE_CACHE_DIR%/payload'
    purge_destination: True

- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/payload/Applications/Auralia 7 Cloud.app'

- Processor: PkgCopier
  Arguments:
    source_pkg: '%pathname%'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
    - '%RECIPE_CACHE_DIR%/payload'

