Description: |
  Downloads the latest version of Musition 7 Cloud as a pkg,
  verifies the code signature, finds the version, then uploads
  the package to Jamf Pro. The downloaded package is then deleted.

  JSS_URL, API_USERNAME, and API_PASSWORD, and for non-cloud instances
  SMB_URL, SMB_USERNAME and SMB_PASSWORD, are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.
Identifier: com.github.davidbpirie.jamf-upload.Musition7Cloud
MinimumVersion: 2.3.0
ParentRecipe: com.github.davidbpirie.pkg.Musition7Cloud

Input:
  NAME: Musition7Cloud
  JAMF_CATEGORY: Music
  JAMF_PKG_NAME: '%NAME%'
  JAMF_PKG_INFO: |
    Fun ways to learn music theory and musicianship. Online music theory
    software, suitable for students of all ages and levels. Become an expert
    at reading sheet music, recognising time signatures, notating rhythms,
    understanding intervals, matching keys signatures and more.
  JAMF_PKG_NOTES: 'Uploaded by AutoPkg'
  JAMF_PKG_PRIORITY: '10'
  JAMF_PKG_REBOOT_REQUIRED: 'False'
  JAMF_PKG_OS_REQUIREMENTS: ''
  JAMF_PKG_REQUIRED_PROCESSOR: None
  JAMF_PKG_SEND_NOTIFICATION: 'False'
  JAMF_PKG_REPLACE: 'False'
  JAMF_PKG_REPLACE_METADATA: 'False'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_name: '%JAMF_PKG_NAME%-%version%.pkg'
      pkg_category: '%JAMF_CATEGORY%'
      pkg_info: '%JAMF_PKG_INFO%'
      pkg_notes: '%JAMF_PKG_NOTES%'
      pkg_priority: '%JAMF_PKG_PRIORITY%'
      reboot_required: '%JAMF_PKG_REBOOT_REQUIRED%'
      os_requirements: '%JAMF_PKG_OS_REQUIREMENTS%'
      required_processor: '%JAMF_PKG_REQUIRED_PROCESSOR%'
      send_notification: '%JAMF_PKG_SEND_NOTIFICATION%'
      replace_pkg: '%JAMF_PKG_REPLACE%'
      replace_pkg_metadata: '%JAMF_PKG_REPLACE_METADATA%'

  - Processor: PathDeleter
    Arguments:
      path_list:
      - '%pkg_path%'
