Description: |
  Downloads the latest version of QLab 5, creates an installer package from
  the app, then uploads the package to Jamf Pro and deletes the package.

  JSS_URL, either API_USERNAME and API_PASSWORD or CLIENT_ID and CLIENT_SECRET,
  and for non-cloud instances SMB_URL, SMB_USERNAME and SMB_PASSWORD, are
  expected to be populated in your AutoPkg preferences, override Input
  variables, or by command-line keys.

Identifier: com.github.davidbpirie.jamf-upload.QLab5
ParentRecipe: com.github.jazzace.pkg.QLab5
MinimumVersion: 2.3.0

Input:
  NAME: QLab5
  JAMF_CATEGORY: Photo and Video
  JAMF_PKG_NAME: '%NAME%'
  JAMF_PKG_INFO: QLab 5 is a live media playback and show control program. Its design is based around concepts and conventions of the theatrical, broadcast, and cinematic industries, but it is intended to be flexible and adaptable enough to be used in many other contexts.
  JAMF_PKG_NOTES: 'Generated and uploaded by AutoPkg'
  JAMF_PKG_PRIORITY: '10'
  JAMF_PKG_REBOOT_REQUIRED: 'False'
  JAMF_PKG_OS_REQUIREMENTS: ''
  JAMF_PKG_REQUIRED_PROCESSOR: None
  JAMF_PKG_SEND_NOTIFICATION: 'False'
  JAMF_PKG_REPLACE: 'False'
  JAMF_PKG_REPLACE_METADATA: 'False'

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_name: '%JAMF_PKG_NAME%-%version%.pkg'
      pkg_category: '%JAMF_CATEGORY%'
      pkg_info: '%JAMF_PKG_INFO%'
      pkg_notes: '%JAMF_PKG_NOTES%'
      pkg_priority: '%JAMF_PKG_PRIORITY%'
      reboot_required: '%JAMF_PKG_REBOOT_REQUIRED%'
      os_requirements: '%JAMF_PKG_OS_REQUIREMENTS%'
      required_processor: '%JAMF_PKG_REQUIRED_PROCESSOR%'
      send_notification: '%JAMF_PKG_SEND_NOTIFICATION%'
      replace_pkg: '%JAMF_PKG_REPLACE%'
      replace_pkg_metadata: '%JAMF_PKG_REPLACE_METADATA%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%pkg_path%'
