Description: |
  Downloads the latest version of SketchUp for a given release
  year as a DMG, builds a pkg, then imports it to Munki and deletes
  the package.
Identifier: com.github.davidbpirie.munki.sketchuppro
ParentRecipe: com.github.davidbpirie.pkg.sketchuppro
MinimumVersion: 2.3.0

Input:
  RELEASE_YEAR: '2022'
  NAME: SketchUpPro%RELEASE_YEAR%
  MUNKI_DISPLAYNAME: SketchUp Pro %RELEASE_YEAR%
  MUNKI_DESCRIPTION: SketchUp is the most intuitive way to design, document and communicate your ideas in 3D.
  MUNKI_CATEGORY: Graphics and Design
  MUNKI_DEVELOPER: Trimble
  MUNKI_MINIMUM_OS_VERSION: 10.15.0
  MUNKI_REPO_SUBDIR: '%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%'
  pkginfo:
    blocking_applications:
      - SketchUp.app
    catalogs:
      - testing
    category: '%MUNKI_CATEGORY%'
    description: '%MUNKI_DESCRIPTION%'
    developer: '%MUNKI_DEVELOPER%'
    display_name: '%MUNKI_DISPLAYNAME%'
    minimum_os_version: '%MUNKI_MINIMUM_OS_VERSION%'
    name: '%NAME%'
    unattended_install: true

Process:
  - Processor: MunkiImporter
    Arguments:
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%pkg_path%'
