<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of SketchUp for a given release year as a DMG, builds a pkg, then imports it to Munki.</string>
		<key>Identifier</key>
		<string>com.github.davidbpirie.munki.sketchuppro</string>
		<key>MinimumVersion</key>
		<string>2.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.davidbpirie.pkg.sketchuppro</string>
		<key>Input</key>
		<dict>
            <key>RELEASE_YEAR</key>
            <string>2022</string>
            <key>NAME</key>
            <string>SketchUpPro%RELEASE_YEAR%</string>
			<key>MUNKI_DISPLAYNAME</key>
			<string>SketchUp Pro %RELEASE_YEAR%</string>
			<key>MUNKI_DESCRIPTION</key>
			<string>SketchUp is the most intuitive way to design, document and communicate your ideas in 3D.</string>
			<key>MUNKI_CATEGORY</key>
			<string>Graphics and Design</string>
			<key>MUNKI_DEVELOPER</key>
			<string>Trimble</string>
			<key>MUNKI_MINIMUM_OS_VERSION</key>
			<string>10.15.0</string>
			<key>MUNKI_REPO_SUBDIR</key>
            <string>%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%</string>
			<key>pkginfo</key>
			<dict>
				<key>name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>developer</key>
				<string>%MUNKI_DEVELOPER%</string>
				<key>blocking_applications</key>
				<array>
					<string>SketchUp.app</string>
				</array>
				<key>catalogs</key>
				<array>
					<string>dev</string>
				</array>
				<key>description</key>
				<string>%MUNKI_DESCRIPTION%</string>
				<key>display_name</key>
				<string>%MUNKI_DISPLAYNAME%</string>
				<key>minimum_os_version</key>
				<string>%MUNKI_MINIMUM_OS_VERSION%</string>
				<key>unattended_install</key>
				<true />
			</dict>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>