<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of SketchUp for a given release year as a DMG.
			Create separate overrides for each required release year, giving each a unique Identifier.
        </string>
		<key>Identifier</key>
		<string>com.github.davidbpirie.download.sketchuppro</string>
		<key>MinimumVersion</key>
		<string>2.0.0</string>
		<key>Input</key>
		<dict>
			<key>RELEASE_YEAR</key>
			<string>2022</string>
			<key>NAME</key>
			<string>SketchUpPro%RELEASE_YEAR%</string>
			<key>SUP_FOLDER</key>
			<string>SketchUp %RELEASE_YEAR%</string>
			<key>DOWNLOAD_URL</key>
			<string>https://www.sketchup.com/sketchup/%RELEASE_YEAR%/SketchUpPro-dmg</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/%SUP_FOLDER%/SketchUp.app</string>
					<key>requirement</key>
					<string>identifier "com.sketchup.SketchUp.%RELEASE_YEAR%" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = J8PVMCY7KL</string>
					<key>strict_verification</key>
					<true />
				</dict>
			</dict>
		</array>
	</dict>
</plist>