<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of SketchUp for a given release year as a dmg, then builds a pkg.

			Create separate overrides for each required release year, giving each a unique Identifier.
        </string>
        <key>Identifier</key>
        <string>com.github.davidbpirie.pkg.sketchuppro</string>
        <key>MinimumVersion</key>
        <string>2.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.davidbpirie.download.sketchuppro</string>
        <key>Input</key>
        <dict>
            <key>RELEASE_YEAR</key>
            <string>2022</string>
            <key>NAME</key>
            <string>SketchUpPro%RELEASE_YEAR%</string>
            <key>SUP_FOLDER</key>
            <string>SketchUp %RELEASE_YEAR%</string>
        </dict>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>PlistReader</string>
                <key>Arguments</key>
                <dict>
                    <key>info_path</key>
                    <string>%pathname%/%SUP_FOLDER%/SketchUp.app/Contents/Info.plist</string>
                    <key>plist_keys</key>
                    <dict>
                        <key>CFBundleVersion</key>
                        <string>version</string>
                        <key>CFBundleIdentifier</key>
                        <string>bundleid</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>pkgdirs</key>
                    <dict>
                        <key>Applications</key>
                        <string>0775</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%/%SUP_FOLDER%</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Applications/%SUP_FOLDER%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgname</key>
                        <string>%NAME%-%version%</string>
                        <key>version</key>
                        <string>%version%</string>
                        <key>id</key>
                        <string>%bundleid%.pkg</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>path</key>
                                <string>Applications</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>admin</string>
                                <key>mode</key>
                                <string>0755</string>
                            </dict>
                            <dict>
                                <key>path</key>
                                <string>Applications/%SUP_FOLDER%</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>admin</string>
                                <key>mode</key>
                                <string>0755</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
