<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release Intel version of Azul Zulu OpenJDK 17 LTS, extracts the package, and imports it to munki.
            Based on Azul Zulu OpenJDK 11 LTS recipes by dataJAR.</string>
        <key>Identifier</key>
        <string>com.github.davidbpirie.munki.x64.AzulZuluOpenJDK17LTS</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>AzulZuluOpenJDK17LTS</string>
            <key>ARCHITECTURE</key>
            <string>x</string>
            <key>MUNKI_NAME</key>
            <string>AzulZuluOpenJDK17LTS</string>
            <key>MUNKI_DISPLAY_NAME</key>
            <string>Azul Zulu Open JDK 17 LTS (x86)</string>
            <key>MUNKI_DESCRIPTION</key>
            <string>Azul Zulu builds of OpenJDK are open source, TCK-tested and certified builds of OpenJDK. Azul Zulu is available for a wide range of hardware platforms and operating systems.</string>
            <key>MUNKI_CATEGORY</key>
            <string>Developer Tools</string>
            <key>MUNKI_DEVELOPER</key>
            <string>Azul Systems</string>
            <key>MUNKI_MINIMUM_OS_VERSION</key>
            <string>10.14.0</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>Developer Tools/Azul Systems/AzulZuluOpenJDK17LTS</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>supported_architectures</key>
                <array>
                    <string>x86_64</string>
                </array>
                <key>unattended_install</key>
                <true />
                <key>unattended_uninstall</key>
                <true />
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.4</string>
        <key>ParentRecipe</key>
        <string>com.github.davidbpirie.pkg.AzulZuluOpenJDK17LTS</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>name</key>
                        <string>%MUNKI_NAME%</string>
                        <key>display_name</key>
                        <string>%MUNKI_DISPLAYNAME%</string>
                        <key>description</key>
                        <string>%MUNKI_DESCRIPTION%</string>
                        <key>category</key>
                        <string>%MUNKI_CATEGORY%</string>
                        <key>developer</key>
                        <string>%MUNKI_DEVELOPER%</string>
                        <key>minimum_os_version</key>
                        <string>%MUNKI_MINIMUM_OS_VERSION%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <key>flat_pkg_path</key>
                    <string>%pkg_path%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>pkgdirs</key>
                    <dict>
                        <key>Library</key>
                        <string>0755</string>
                        <key>Library/Java</key>
                        <string>0755</string>
                        <key>Library/Java/JavaVirtualMachines</key>
                        <string>0755</string>
                        <key>Library/Java/JavaVirtualMachines/zulu-17.jdk</key>
                        <string>0755</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Library/Java/JavaVirtualMachines/zulu-17.jdk</string>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/zulu-17.pkg/Payload</string>
                    <key>purge_destination</key>
                    <true />
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiInstallsItemsCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>faux_root</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
                    <key>installs_item_paths</key>
                    <array>
                        <string>/Library/Java/JavaVirtualMachines/zulu-17.jdk</string>
                    </array>
                    <key>version_comparison_key</key>
                    <string>CFBundleVersion</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PlistReader</string>
                <key>Arguments</key>
                <dict>
                    <key>info_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/Library/Java/JavaVirtualMachines/zulu-17.jdk/Contents/Info.plist</string>
                    <key>plist_keys</key>
                    <dict>
                        <key>CFBundleVersion</key>
                        <string>version</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiPkginfoMerger</string>
                <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pkg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/%NAME%/</string>
                        <string>%RECIPE_CACHE_DIR%/unpack/</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>