Description: |
  Downloads the current release version of Azul Zulu OpenJDK 17 LTS.
  Set the ARCHITECTURE key to "x" to download the Intel version or "aarch" for Apple Silicon version.
  Based on Azul Zulu OpenJDK 11 LTS recipes by dataJAR.
Identifier: com.github.davidbpirie.download.AzulZuluOpenJDK17LTS
MinimumVersion: 2.3.0

Input:
  NAME: AzulZuluOpenJDK17LTS
  ARCHITECTURE: x

Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: \"(zulu17.*?-ca-jdk17.*?-macosx_%ARCHITECTURE%64\.dmg)\"
    url: https://cdn.azul.com/zulu/bin/?C=M;O=D

- Processor: URLDownloader
  Arguments:
    url: https://cdn.azul.com/zulu/bin/%match%

- Processor: EndOfCheckPhase

- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: Azul Systems, Inc. (TDTHCUPYFR)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%/Double-Click to Install Azul Zulu JDK 17.pkg'
