Description: |
  Downloads the current release Apple Silicon version of Azul Zulu OpenJDK 17 LTS,
  extracts the package, and imports it to munki.
  Based on Azul Zulu OpenJDK 11 LTS recipes by dataJAR.
Identifier: com.github.davidbpirie.munki.ARM.AzulZuluOpenJDK17LTS
ParentRecipe: com.github.davidbpirie.pkg.AzulZuluOpenJDK17LTS
MinimumVersion: 2.3.0

Input:
  NAME: AzulZuluOpenJDK17LTS
  ARCHITECTURE: aarch
  MUNKI_DISPLAYNAME: Azul Zulu Open JDK 17 LTS (ARM)
  MUNKI_DESCRIPTION: Azul Zulu builds of OpenJDK are open source, TCK-tested and certified builds of OpenJDK. Azul Zulu is available for a wide range of hardware platforms and operating systems.
  MUNKI_CATEGORY: Developer Tools
  MUNKI_DEVELOPER: Azul Systems
  MUNKI_MINIMUM_OS_VERSION: 11.0.0
  MUNKI_REPO_SUBDIR: '%MUNKI_CATEGORY%/%MUNKI_DEVELOPER%/%NAME%/%ARCHITECTURE%'
  pkginfo:
    catalogs:
    - testing
    supported_architectures:
    - arm64
    category: '%MUNKI_CATEGORY%'
    description: '%MUNKI_DESCRIPTION%'
    developer: '%MUNKI_DEVELOPER%'
    display_name: '%MUNKI_DISPLAYNAME%'
    minimum_os_version: '%MUNKI_MINIMUM_OS_VERSION%'
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true

Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%pkg_path%'

- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Library: '0755'
      Library/Java: '0755'
      Library/Java/JavaVirtualMachines: '0755'
      Library/Java/JavaVirtualMachines/zulu-17.jdk: '0755'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'

- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%/Library/Java/JavaVirtualMachines/zulu-17.jdk'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/zulu-17.pkg/Payload'
    purge_destination: true

- Processor: MunkiInstallsItemsCreator
  Arguments:
    faux_root: '%RECIPE_CACHE_DIR%/%NAME%/'
    installs_item_paths:
    - /Library/Java/JavaVirtualMachines/zulu-17.jdk
    version_comparison_key: CFBundleVersion

- Processor: MunkiPkginfoMerger

- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/%NAME%/Library/Java/JavaVirtualMachines/zulu-17.jdk/Contents/Info.plist'
    plist_keys:
      CFBundleVersion: version

- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      version: '%version%'

- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pkg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'

- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/%NAME%/'
    - '%RECIPE_CACHE_DIR%/unpack/'
