Description: |
  Downloads the latest version of VS Code and makes a pkg of it, then
  uploads the package to Jamf Pro, creating the Category if required.

  JSS_URL, API_USERNAME, and API_PASSWORD, and for non-cloud instances
  SMB_URL, SMB_USERNAME and SMB_PASSWORD, are expected to be populated
  in your AutoPkg preferences, override Input variables, or by
  command-line keys.
Identifier: com.github.davidbpirie.jamf-upload.VisualStudioCode
MinimumVersion: "2.3"
ParentRecipe: com.github.killahquam.pkg.visualstudioscode

Input:
  NAME: VisualStudioCode
  JAMF_CATEGORY: Developer Tools
  JAMF_CATEGORY_PRIORITY: "10"
  JAMF_REPLACE_CATEGORY: "False"
  JAMF_PKG_NAME: "%NAME%"
  JAMF_PKG_INFO: "Visual Studio Code is a lightweight but powerful source code editor which runs on your desktop and is available for Windows, macOS and Linux. It comes with built-in support for JavaScript, TypeScript and Node.js and has a rich ecosystem of extensions for other languages (such as C++, C#, Java, Python, PHP, Go) and runtimes (such as .NET and Unity)."
  JAMF_PKG_NOTES: "Generated and uploaded by AutoPkg"
  JAMF_PKG_PRIORITY: "10"
  JAMF_REBOOT_REQUIRED: "False"
  JAMF_OS_REQUIREMENTS: ""
  JAMF_REQUIRED_PROCESSOR: None
  JAMF_SEND_NOTIFICATION: "False"
  JAMF_REPLACE_PKG: "False"
  JAMF_REPLACE_PKG_METADATA: "False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%JAMF_CATEGORY%"
      category_priority: "%JAMF_CATEGORY_PRIORITY%"
      replace_category: "%JAMF_REPLACE_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_name: "%JAMF_PKG_NAME%-%version%.pkg"
      pkg_category: "%JAMF_CATEGORY%"
      pkg_info: "%JAMF_PKG_INFO%"
      pkg_notes: "%JAMF_PKG_NOTES%"
      pkg_priority: "%JAMF_PKG_PRIORITY%"
      reboot_required: "%JAMF_REBOOT_REQUIRED%"
      os_requirements: "%JAMF_OS_REQUIREMENTS%"
      required_processor: "%JAMF_REQUIRED_PROCESSOR%"
      send_notification: "%JAMF_SEND_NOTIFICATION%"
      replace_pkg: "%JAMF_REPLACE_PKG%"
